
// Написано в FreeBSD, Midnight Commander.
// Ukraine. (C) Demidov S.V.

// ---
// | Показать модальное окно.
// | BS.
// ---
function BSOpenShowModalWin(x)
{
	// Слой затемнения.
	var darkLayer = document.createElement("div");
		// id чтобы подхватить стиль.
		darkLayer.id = "shadowbs";
			// Включаем затемнение.
			document.body.appendChild(darkLayer);

	var modalWin = document.getElementById(x); // Находим наше "окно".
	modalWin.style.display = "block"; // "Включаем" его.

	darkLayer.onclick = function ()
		{
		// При клике на слой затемнения, всё исчезает.
		darkLayer.parentNode.removeChild(darkLayer); // Удаляем затемнение.
		modalWin.style.display = "none"; // "Выключаем" окно.
		return false;
		}

	document.addEventListener("keydown", function(e){
		if (e.which == 27)
			{
			// Код, который должен быть выполнен после нажатия на кнопку ESC.
			darkLayer.parentNode.removeChild(darkLayer); // Удаляем затемнение.
			modalWin.style.display = "none"; // "Выключаем" окно.
			return false;
			}
	});
}

// ---
// | Закрыть модальное окно.
// ---
function BSCloseModalWin(x)
{
	// Удаляем затемнение.
	var darkLayer = document.getElementById("shadowbs");
	darkLayer.parentNode.removeChild(darkLayer);

	var modalWin = document.getElementById(x); // Находим наше "окно".
	modalWin.style.display = "none"; // "Выключаем" окно.
}

// ---
// | Создать калькулятор!
// | Для модального окна!
// ---
function BuildBS1(id)
{
	var string = BShtmlcode();

	// Горизонтальная линия.
	string += "<br>";
	string += "<hr class=\"bs_hr\">";
	string += "<br>";

	// Кнопка закрыть.
	string += "<table align=\"center\" class=\"txtbutton\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";

	string += "<tr>";
	string += "<td>";
	string += "<a href=\"javascript:BSCloseModalWin('ModalWinBS')\">закрыть</a>";
	string += "</td>";
	string += "</tr>";

	string += "</table>";

	// Отступ.
	string+="<br>";

	// вставить в страницу.
	document.getElementById(id).innerHTML = string;
}

// ---
// | Создать калькулятор!
// | Для страницы!
// ---
function BuildBS2(id)
{
	var string = BShtmlcode();

	// вставить в страницу.
	document.getElementById(id).innerHTML = string;
}

// ---
// | Калькулятор БСС (html-код).
// ---
function BShtmlcode()
{
	var string;

	string = "<table align=\"center\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";
	string += "<tr>";
	string += "<td align=\"center\">";

	string += "<br>";
	string += "<hr class=\"bs_hr\">";
	string += "<br>";

	string += "<!-- Заголовок -->";

		string += "<table class=\"bstitle\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";

		string += "<tr>";
		string += "<td align=\"center\">";

		string += "Калькулятор ближайшее стандартное сопротивление (БСС)";

		string += "</td>";
		string += "</tr>";

		string += "</table>";

		string += "<br>";

		string += "<!-- Онлайн калькулятор БСС -->";
		string += "<!-- Найти ближайшее стандартное -->";

		string += "<table class=\"bsbg1\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";

		string += "<tr>";
		string += "<td>";

			string += "<!-- Выбор: E24, E48, E96-->";

			string += "<table class=\"bsbg2\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";
			string += "<tr>";

			string += "<!-- E24 -->";
			string += "<td>";
			string += "<span title=\"Всех резисторов: 216. Точность резисторов: ±5%\">Набор резисторов <b>E24</b>:</span>&nbsp;";
			string += "</td>";

			string += "<td class=\"bsrbpaddingb bsrbpaddingr\">";

				string += "<!-- [ x ] -->";
				string += "<input name=\"BS\" id=\"bsrb_1\" class=\"bsradiobutton\" type=\"radio\" value=\"\" checked>";
				string += "<label for=\"bsrb_1\" class=\"bs_label_radio\" title=\"Всех резисторов: 216. Точность резисторов: ±5%\"></label>";

			string += "</td>";

			string += "<!-- E48 -->";
			string += "<td>";
			string += "&nbsp;&nbsp;&nbsp;<span title=\"Всех резисторов: 384. Точность резисторов: ±2%\">Набор резисторов <b>E48</b>:</span>&nbsp;";
			string += "</td>";

			string += "<td class=\"bsrbpaddingb bsrbpaddingr\">";

				string += "<!-- [   ] -->";
				string += "<input name=\"BS\" id=\"bsrb_2\" class=\"bsradiobutton\" type=\"radio\" value=\"\">";
				string += "<label for=\"bsrb_2\" class=\"bs_label_radio\" title=\"Всех резисторов: 384. Точность резисторов: ±2%\"></label>";

			string += "</td>";

			string += "<!-- E96 -->";
			string += "<td>";
			string += "&nbsp;&nbsp;&nbsp;<span title=\"Всех резисторов: 768. Точность резисторов: ±1%\">Набор резисторов <b>E96</b>:</span>&nbsp;";
			string += "</td>";

			string += "<td class=\"bsrbpaddingb\">";

				string += "<!-- [   ] -->";
				string += "<input name=\"BS\" id=\"bsrb_3\" class=\"bsradiobutton\" type=\"radio\" value=\"\">";
				string += "<label for=\"bsrb_3\" class=\"bs_label_radio\" title=\"Всех резисторов: 768. Точность резисторов: ±1%\"></label>";

			string += "</td>";

			string += "</tr>";
			string += "</table>";

		string += "</td>";
		string += "</tr>";

		string += "<tr>";
		string += "<td align=\"center\">";

			string += "<table class=\"bsbg3\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";
			string += "<tr>";

			string += "<!-- 1 -->";
			string += "<td>";
			string += "Введите сопротивление:";
			string += "</td>";

			string += "<!-- 2 -->";
			string += "<td>&nbsp;</td>";

			string += "<!-- 3 -->";
			string += "<td>";
			string += "<input id=\"bsr_input\" type=\"number\" class=\"bsinputpx\" step=\"0.01\" min=\"0.1\" max=\"100000000\" value=\"5000\" ";
			string += "title=\"\">";
			string += "</td>";

			string += "<!-- 4 -->";
			string += "<td>";
				string += "&nbsp;<select id=\"bsr_option\" title=\"Выберите: Ом, кОм, мОм \">";
				string += "<option select value=\"Ом\" title=\"\" selected>Ом</option>";
				string += "<option select value=\"кОм\" title=\"\">кОм</option>";
				string += "<option select value=\"мОм\" title=\"\">мОм</option>";
				string += "</select>&nbsp;";
			string += "</td>";

			string += "<!-- 5 -->";
			string += "<td>";
				string += "[&nbsp;<a href=\"javascript:CALCBSRClearInput()\"";
				string += "title=\"Очистить поле ввода\">Очистить</a>&nbsp;]";
			string += "</td>";

			string += "<!-- 6 -->";
			string += "<td>";
				string += "&nbsp;[&nbsp;<a href=\"javascript:CALCBSRSetInput()\"";
				string += "title=\"Установить поля ввода по умолчанию, плюс сбросить вычисления\">По умолчанию</a>&nbsp;]";
			string += "</td>";

			string += "</tr>";
			string += "</table>";

		string += "</td>";
		string += "</tr>";

		string += "<tr>";
		string += "<td align=\"center\" style=\"padding-top: 6px; padding-bottom: 6px;\">";

			string += "<!-- Кнопка \"Посчитать\" -->";
			string += "<input type=\"submit\" onclick=\"CALCBSR()\" value=\"Найти ближайшее стандартное\">";

		string += "</td>";
		string += "</tr>";

		string += "<!-- Результат сюда -->";

		string += "<tr>";
		string += "<td id=\"CALCZDBSR\" align=\"center\" class=\"calczdbsr\" style=\"padding-top: 3px; padding-bottom: 3px;\">";

			string += "Ближайшее стандартное (<b>E24<b>): <span class=\"bsrquestion\">?</span>";

		string += "</td>";
		string += "</tr>";

		string += "</table>";

	string += "</td>";
	string += "</tr>";
	string += "</table>";

	return string;
}

// ---
// | Считаем (вычисления).
// | Найти ближайшее стандартное сопротивление.
// ---
function CALCBSR()
{
	var R, E, Ek, Em, El, Elk, Elm, Er, Erk, Erm, Eline, string;
	var ArrayResistor = [];

	var Option = document.getElementById('bsr_option').value;

	R = Number(document.getElementById('bsr_input').value);

	if (R == 0)
		{
		return false;
		}

	if (Option == "кОм")
		{
		// Перевод в Ом'ы.
		R = R * 1000;
		}

	if (Option == "мОм")
		{
		// Перевод в Ом'ы.
		R = R * 1000 * 1000;
		}

	// Если набор резисторов E24.
	if (document.getElementById('bsrb_1').checked)
		{
		ArrayResistor = SearchE24(R); // Ближайшее стандартное. Ряд E24.
		Eline = "(<b>E24</b>)";
		}

	// Если набор резисторов E48.
	if (document.getElementById('bsrb_2').checked)
		{
		ArrayResistor = SearchE48(R); // Ближайшее стандартное. Ряд 48.
		Eline = "(<b>E48</b>)";
		}

	// Если набор резисторов E96.
	if (document.getElementById('bsrb_3').checked)
		{
		ArrayResistor = SearchE96(R); // Ближайшее стандартное. Ряд 96.
		Eline = "(<b>E96</b>)";
		}

	// - [!] -
	E = ArrayResistor[0]; El =  ArrayResistor[1]; Er =  ArrayResistor[2];

	string = "<table cellspacing=\"0\" cellpadding=\"0\" border=\"0\">";

	string += "<tr>";
	string += "<td align=\"left\" style=\"padding-bottom: 4px;\">";
		string += "Ближайшее стандартное " + Eline + ": ";
	string += "</td>";
	string += "</tr>";

		// Самое первое сопротивление.
		// E = 0, El = Значение, Er = 0.
		if (E == 0 && El != 0 && Er == 0)
			{
			Elk = El / 1000; // В кОм.
			Elm = El / 1000 / 1000; // В мОм.

			string += "<tr>";
			string += "<td align=\"left\">";
				string += "&nbsp;&nbsp;&nbsp;<b>R</b> = <span class=\"bsranswer\">" + El + " <b>Ом</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Elk + " <b>кОм</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Elm + " <b>мОм</b>" + "</span>";
			string += "</td>";
			string += "</tr>";
			}

		// Самое последнее сопротивление.
		// E = 0, El = 0, Er = Значение.
		if (E == 0 && El == 0 && Er != 0)
			{
			Erk = Er / 1000; // В кОм.
			Erm = Er / 1000 / 1000; // В мОм.

			string += "<tr>";
			string += "<td align=\"left\">";
				string += "&nbsp;&nbsp;&nbsp;<b>R</b> = <span class=\"bsranswer\">" + Er + " <b>Ом</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Erk + " <b>кОм</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Erm + " <b>мОм</b>" + "</span>";
			string += "</td>";
			string += "</tr>";
			}

		// Сопротивление есть в массиве.
		// E = Значение, El = 0, Er = 0.
		if (E != 0 && El == 0 && Er == 0)
			{
			Ek = E / 1000; // В кОм.
			Em = E / 1000 / 1000; // В мОм.

			string += "<tr>";
			string += "<td align=\"left\">";
				string += "&nbsp;&nbsp;&nbsp;<b>R</b> = <span class=\"bsranswer\">" + E + " <b>Ом</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Ek + " <b>кОм</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Em + " <b>мОм</b>" + "</span>";
			string += "</td>";
			string += "</tr>";
			}

		// Ближайшее значение слева и справа.
		// E = 0, El = Значение слева, Er = Значение справа
		if (E == 0 && El != 0 && Er != 0)
			{
			Elk = El / 1000; // В кОм.
			Elm = El / 1000 / 1000; // В мОм.

			Erk = Er / 1000; // В кОм.
			Erm = Er / 1000 / 1000; // В мОм.

			// Сопротивление резистора слева.
			string += "<tr>";
			string += "<td align=\"left\">";
				string += "&nbsp;&nbsp;&nbsp;<b>R</b> = <span class=\"bsranswer\">" + El + " <b>Ом</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Elk + " <b>кОм</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Elm + " <b>мОм</b>" + "</span>";
			string += "</td>";
			string += "</tr>";

			// или
			string += "<tr>";
			string += "<td align=\"left\">";
			string += "&nbsp;&nbsp;&nbsp;<b>или</b>";
			string += "</td>";
			string += "</tr>";

			// Сопротивление резистора справа.
			string += "<tr>";
			string += "<td align=\"left\">";
				string += "&nbsp;&nbsp;&nbsp;<b>R</b> = <span class=\"bsranswer\">" + Er + " <b>Ом</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Erk + " <b>кОм</b>" + "</span>, ";
				string += "<span class=\"bsranswer\">" + Erm + " <b>мОм</b>" + "</span>";
			string += "</td>";
			string += "</tr>";
			}

	string += "</table>";

	// вставить в страницу.
	document.getElementById('CALCZDBSR').innerHTML = string;
}

// ---
// | Очистить input.
// ---
function CALCBSRClearInput()
{
	document.getElementById('bsr_input').value = "";
}

// ---
// | Установить по умолчанию.
// ---
function CALCBSRSetInput()
{
	// Установить в поле ввода 5000.
	document.getElementById('bsr_input').value = 5000;

	// Установить Ом'ы.
	document.getElementById('bsr_option').value = "Ом";

	// Вставить в калькулятор БСС знак вопроса.
	document.getElementById('CALCZDBSR').innerHTML = "Ближайшее стандартное (<b>E24<b>): <span class=\"bsrquestion\">?</span>";

	// Установиить Radio Buttons.
	document.getElementById('bsrb_1').checked = true;  // E24.
	document.getElementById('bsrb_2').checked = false; // E48.
	document.getElementById('bsrb_3').checked = false; // E96.
}

// ---
// | Находим ближайшее стандартное сопротивление.
// | E24.
// ---
function SearchE24(R1)
{
	// Таблица резисторов Е24 (в Омах). Всего 216.
	// +- 5%.
	var ArrayE24 = [
			0.1, 0.11, 0.12, 0.13, 0.15, 0.16, 0.18, 0.2,
			0.22, 0.24, 0.27, 0.3, 0.33, 0.36, 0.39, 0.43,
			0.47, 0.51, 0.56, 0.62, 0.68, 0.75, 0.82, 0.91,
			1, 1.1, 1.2, 1.3, 1.5, 1.6, 1.8, 2,
			2.2, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.3,
			4.7, 5.1, 5.6, 6.2, 6.8, 7.5, 8.2, 9.1, 10, 11,
			12, 13, 15, 16, 18, 20, 22, 24,
			27, 30, 33, 36, 39, 43, 47, 51,
			56, 62, 68, 75, 82, 91, 100, 110,
			120, 130, 150, 160, 180, 200, 220, 240,
			270, 300, 330, 360, 390, 430, 470, 510,
			560, 620, 680, 750, 820, 910, 1000, 1100, 1200,
			1300, 1500, 1600, 1800, 2000, 2200, 2400, 2700,
			3000, 3300, 3600, 3900, 4300, 4700, 5100, 5600,
			6200, 6800, 7500, 8200, 9100, 10000, 11000, 12000,
			13000, 15000, 16000, 18000, 20000, 22000, 24000, 27000,
			30000, 33000, 36000, 39000, 43000, 47000, 51000, 56000,
			62000, 68000, 75000, 82000, 91000, 100000, 110000, 120000,
			130000, 150000, 160000, 180000, 200000, 220000, 240000, 270000,
			300000, 330000, 360000, 390000, 430000, 470000, 510000, 560000,
			620000, 680000, 750000, 820000, 910000, 1000000, 1100000, 1200000,
			1300000, 1500000, 1600000, 1800000, 2000000, 2200000, 2400000, 2700000,
			3000000, 3300000, 3600000, 3900000, 4300000, 4700000, 5100000, 5600000,
			6200000, 6800000, 7500000, 8200000, 9100000, 10000000, 11000000, 12000000,
			13000000, 15000000, 16000000, 18000000, 20000000, 22000000, 24000000, 27000000,
			30000000, 33000000, 36000000, 39000000, 43000000, 47000000, 51000000, 56000000,
			62000000, 68000000, 75000000, 82000000, 91000000
		];

	var z, E24, E24l, E24r;

	E24 = 0; E24l = 0; E24r = 0;

	// [ Шаг 1 ]
	// Ищем ближайшее стандартное.
	// Самое первое сопротивление!
	if (R1 < ArrayE24[0])
		{
		E24l = ArrayE24[0];
		}
		else
		{
		// [ Шаг 2 ]
		// Ищем ближайшее стандартное.
		// Самое последнее сопротивление!
		if (R1 > ArrayE24[215])
			{
			E24r = ArrayE24[215];
			}
			else
			{
			// [ Шаг 3 ]
			// Ищем ближайшее стандартное.
			// Проверим, может такое сопротивление есть в массиве!
			for(z = 0; z < ArrayE24.length; z++)
				{
				if (R1 == ArrayE24[z])
					{
					E24 = R1;
					break;
					}
				}

			if (E24 == 0)
				{
				// [ Шаг 4 ]
				// Ищем ближайшее стандартное.
				// Получаем значение слева и справа!
				for(z = 1; z < ArrayE24.length; z++)
					{
					if (ArrayE24[z] > R1)
						{
						// Слева.
						E24l = ArrayE24[z - 1];
						// Справа.
						E24r = ArrayE24[z];
						break;
						}
					}
				}
			}
		}

	// Самое первое сопротивление!
	// E24 = 0, E24l = Значение, E24r = 0.

	// Самое последнее сопротивление!
	// E24 = 0, E24l = 0, E24r = Значение.

	// Сопротивление есть в массиве!
	// E24 = Значение, E24l = 0, E24r = 0.

	// Ближайшее значение слева и справа!
	// E24 = 0, E24l = Значение слева, E24r = Значение справа.

	// Возвращаем массив!
	return [E24, E24l, E24r];
}

// ---
// | Находим ближайшее стандартное сопротивление.
// | E48.
// ---
function SearchE48(R1)
{
	// Таблица резисторов Е48 (в Омах). Всего 384.
	// +- 2%.
	var ArrayE48 = [
			1, 1.05, 1.1, 1.15, 1.21, 1.27, 1.33, 1.4,
			1.47, 1.54, 1.62, 1.69, 1.78, 1.87, 1.96, 2.05,
			2.15, 2.26, 2.37, 2.49, 2.61, 2.74, 2.87, 3.01,
			3.16, 3.32, 3.48, 3.65, 3.83, 4.02, 4.22, 4.42,
			4.64, 4.87, 5.11, 5.36, 5.62, 5.9, 6.19, 6.49,
			6.81, 7.15, 7.5, 7.87, 8.25, 8.66, 9.09, 9.53,
			10, 10.5, 11, 11.5, 12.1, 12.7, 13.3, 14,
			14.7, 15.4, 16.2, 16.9, 17.8, 18.7, 19.6, 20.5,
			21.5, 22.6, 23.7, 24.9, 26.1, 27.4, 28.7, 30.1,
			31.6, 33.2, 34.8, 36.5, 38.3, 40.2, 42.2, 44.2,
			46.4, 48.7, 51.1, 53.6, 56.2, 59, 61.9, 64.9,
			68.1, 71.5, 75, 78.7, 82.5, 86.6, 90.9, 95.3,
			100, 105, 110, 115, 121, 127, 133, 140,
			147, 154, 162, 169, 178, 187, 196, 205,
			215, 226, 237, 249, 261, 274, 287, 301,
			316, 332, 348, 365, 383, 402, 422, 442,
			464, 487, 511, 536, 562, 590, 619, 649,
			681, 715, 750, 787, 825, 866, 909, 953,
			1000, 1050, 1100, 1150, 1210, 1270, 1330, 1400,
			1470, 1540, 1620, 1690, 1780, 1870, 1960, 2050,
			2150, 2260, 2370, 2490, 2610, 2740, 2870, 3010,
			3160, 3320, 3480, 3650, 3830, 4020, 4220, 4420,
			4640, 4870, 5110, 5360, 5620, 5900, 6190, 6490,
			6810, 7150, 7500, 7870, 8250, 8660, 9090, 9530,
			10000, 10500, 11000, 11500, 12100, 12700, 13300, 14000,
			14700, 15400, 16200, 16900, 17800, 18700, 19600, 20500,
			21500, 22600, 23700, 24900, 26100, 27400, 28700, 30100,
			31600, 33200, 34800, 36500, 38300, 40200, 42200, 44200,
			46400, 48700, 51100, 53600, 56200, 59000, 61900, 64900,
			68100, 71500, 75000, 78700, 82500, 86600, 90900, 95300,
			100000, 105000, 110000, 115000, 121000, 127000, 133000, 140000,
			147000, 154000, 162000, 169000, 178000, 187000, 196000, 205000,
			215000, 226000, 237000, 249000, 261000, 274000, 287000, 301000,
			316000, 332000, 348000, 365000, 383000, 402000, 422000, 442000,
			464000, 487000, 511000, 536000, 562000, 590000, 619000, 649000,
			681000, 715000, 750000, 787000, 825000, 866000, 909000, 953000,
			1000000, 1050000, 1100000, 1150000, 1210000, 1270000, 1330000, 1400000,
			1470000, 1540000, 1620000, 1690000, 1780000, 1870000, 1960000, 2050000,
			2150000, 2260000, 2370000, 2490000, 2610000, 2740000, 2870000, 3010000,
			3160000, 3320000, 3480000, 3650000, 3830000, 4020000, 4220000, 4420000,
			4640000, 4870000, 5110000, 5360000, 5620000, 5900000, 6190000, 6490000,
			6810000, 7150000, 7500000, 7870000, 8250000, 8660000, 9090000, 9530000,
			10000000, 10500000, 11000000, 11500000, 12100000, 12700000, 13300000, 14000000,
			14700000, 15400000, 16200000, 16900000, 17800000, 18700000, 19600000, 20500000,
			21500000, 22600000, 23700000, 24900000, 26100000, 27400000, 28700000, 30100000,
			31600000, 33200000, 34800000, 36500000, 38300000, 40200000, 42200000, 44200000,
			46400000, 48700000, 51100000, 53600000, 56200000, 59000000, 61900000, 64900000,
			68100000, 71500000, 75000000, 78700000, 82500000, 86600000, 90900000, 95300000
		];

	var z, E48, E48l, E48r;

	E48 = 0; E48l = 0; E48r = 0;

	// [ Шаг 1 ]
	// Ищем ближайшее стандартное.
	// Самое первое сопротивление!
	if (R1 < ArrayE48[0])
		{
		E48l = ArrayE48[0];
		}
		else
		{
		// [ Шаг 2 ]
		// Ищем ближайшее стандартное.
		// Самое последнее сопротивление!
		if (R1 > ArrayE48[383])
			{
			E48r = ArrayE48[383];
			}
			else
			{
			// [ Шаг 3 ]
			// Ищем ближайшее стандартное.
			// Проверим, может такое сопротивление есть в массиве!
			for(z = 0; z < ArrayE48.length; z++)
				{
				if (R1 == ArrayE48[z])
					{
					E48 = R1;
					break;
					}
				}

			if (E48 == 0)
				{
				// [ Шаг 4 ]
				// Ищем ближайшее стандартное.
				// Получаем значение слева и справа!
				for(z = 1; z < ArrayE48.length; z++)
					{
					if (ArrayE48[z] > R1)
						{
						// Слева.
						E48l = ArrayE48[z - 1];
						// Справа.
						E48r = ArrayE48[z];
						break;
						}
					}
				}
			}
		}

	// Самое первое сопротивление!
	// E48 = 0, E48l = Значение, E48r = 0.

	// Самое последнее сопротивление!
	// E48 = 0, E48l = 0, E48r = Значение.

	// Сопротивление есть в массиве!
	// E48 = Значение, E48l = 0, E48r = 0.

	// Ближайшее значение слева и справа!
	// E48 = 0, E48l = Значение слева, E48r = Значение справа.

	// Возвращаем массив!
	return [E48, E48l, E48r];
}

// ---
// | Находим ближайшее стандартное сопротивление.
// | E96.
// ---
function SearchE96(R1)
{
	// Таблица резисторов Е96 (в Омах). Всего 768.
	// +- 1%.
	var ArrayE96 = [
			1, 1.02, 1.05, 1.07, 1.1, 1.13, 1.15, 1.18,
			1.21, 1.24, 1.27, 1.3, 1.33, 1.37, 1.4, 1.43,
			1.47, 1.5, 1.54, 1.58, 1.62, 1.65, 1.69, 1.74,
			1.78, 1.82, 1.87, 1.91, 1.96, 2, 2.05, 2.1,
			2.15, 2.21, 2.26, 2.32, 2.37, 2.43, 2.49, 2.55,
			2.61, 2.67, 2.74, 2.8, 2.87, 2.94, 3.01, 3.09,
			3.16, 3.24, 3.32, 3.4, 3.48, 3.57, 3.65, 3.74,
			3.83, 3.92, 4.02, 4.12, 4.22, 4.32, 4.42, 4.53,
			4.64, 4.75, 4.87, 4.99, 5.11, 5.23, 5.36, 5.49,
			5.62, 5.76, 5.9, 6.04, 6.19, 6.34, 6.49, 6.65,
			6.81, 6.98, 7.15, 7.32, 7.5, 7.68, 7.87, 8.06,
			8.25, 8.45, 8.66, 8.87, 9.09, 9.31, 9.53, 9.76,
			10, 10.2, 10.5, 10.7, 11, 11.3, 11.5, 11.8,
			12.1, 12.4, 12.7, 13, 13.3, 13.7, 14, 14.3,
			14.7, 15, 15.4, 15.8, 16.2, 16.5, 16.9, 17.4,
			17.8, 18.2, 18.7, 19.1, 19.6, 20, 20.5, 21,
			21.5, 22.1, 22.6, 23.2, 23.7, 24.3, 24.9, 25.5,
			26.1, 26.7, 27.4, 28, 28.7, 29.4, 30.1, 30.9,
			31.6, 32.4, 33.2, 34, 34.8, 35.7, 36.5, 37.4,
			38.3, 39.2, 40.2, 41.2, 42.2, 43.2, 44.2, 45.3,
			46.4, 47.5, 48.7, 49.9, 51.1, 52.3, 53.6, 54.9,
			56.2, 57.6, 59, 60.4, 61.9, 63.4, 64.9, 66.5,
			68.1, 69.8, 71.5, 73.2, 75, 76.8, 78.7, 80.6,
			82.5, 84.5, 86.6, 88.7, 90.9, 93.1, 95.3, 97.6,
			100, 102, 105, 107, 110, 113, 115, 118,
			121, 124, 127, 130, 133, 137, 140, 143,
			147, 150, 154, 158, 162, 165, 169, 174,
			178, 182, 187, 191, 196, 200, 205, 210,
			215, 221, 226, 232, 237, 243, 249, 255,
			261, 267, 274, 280, 287, 294, 301, 309,
			316, 324, 332, 340, 348, 357, 365, 374,
			383, 392, 402, 412, 422, 432, 442, 453,
			464, 475, 487, 499, 511, 523, 536, 549,
			562, 576, 590, 604, 619, 634, 649, 665,
			681, 698, 715, 732, 750, 768, 787, 806,
			825, 845, 866, 887, 909, 931, 953, 976,
			1000, 1020, 1050, 1070, 1100, 1130, 1150, 1180,
			1210, 1240, 1270, 1300, 1330, 1370, 1400, 1430,
			1470, 1500, 1540, 1580, 1620, 1650, 1690, 1740,
			1780, 1820, 1870, 1910, 1960, 2000, 2050, 2100,
			2150, 2210, 2260, 2320, 2370, 2430, 2490, 2550,
			2610, 2670, 2740, 2800, 2870, 2940, 3010, 3090,
			3160, 3240, 3320, 3400, 3480, 3570, 3650, 3740,
			3830, 3920, 4020, 4120, 4220, 4320, 4420, 4530,
			4640, 4750, 4870, 4990, 5110, 5230, 5360, 5490,
			5620, 5760, 5900, 6040, 6190, 6340, 6490, 6650,
			6810, 6980, 7150, 7320, 7500, 7680, 7870, 8060,
			8250, 8450, 8660, 8870, 9090, 9310, 9530, 9760,
			10000, 10200, 10500, 10700, 11000, 11300, 11500, 11800,
			12100, 12400, 12700, 13000, 13300, 13700, 14000, 14300,
			14700, 15000, 15400, 15800, 16200, 16500, 16900, 17400,
			17800, 18200, 18700, 19100, 19600, 20000, 20500, 21000,
			21500, 22100, 22600, 23200, 23700, 24300, 24900, 25500,
			26100, 26700, 27400, 28000, 28700, 29400, 30100, 30900,
			31600, 32400, 33200, 34000, 34800, 35700, 36500, 37400,
			38300, 39200, 40200, 41200, 42200, 43200, 44200, 45300,
			46400, 47500, 48700, 49900, 51100, 52300, 53600, 54900,
			56200, 57600, 59000, 60400, 61900, 63400, 64900, 66500,
			68100, 69800, 71500, 73200, 75000, 76800, 78700, 80600,
			82500, 84500, 86600, 88700, 90900, 93100, 95300, 97600,
			100000, 102000, 105000, 107000, 110000, 113000, 115000, 118000,
			121000, 124000, 127000, 130000, 133000, 137000, 140000, 143000,
			147000, 150000, 154000, 158000, 162000, 165000, 169000, 174000,
			178000, 182000, 187000, 191000, 196000, 200000, 205000, 210000,
			215000, 221000, 226000, 232000, 237000, 243000, 249000, 255000,
			261000, 267000, 274000, 280000, 287000, 294000, 301000, 309000,
			316000, 324000, 332000, 340000, 348000, 357000, 365000, 374000,
			383000, 392000, 402000, 412000, 422000, 432000, 442000, 453000,
			464000, 475000, 487000, 499000, 511000, 523000, 536000, 549000,
			562000, 576000, 590000, 604000, 619000, 634000, 649000, 665000,
			681000, 698000, 715000, 732000, 750000, 768000, 787000, 806000,
			825000, 845000, 866000, 887000, 909000, 931000, 953000, 976000,
			1000000, 1020000, 1050000, 1070000, 1100000, 1130000, 1150000, 1180000,
			1210000, 1240000, 1270000, 1300000, 1330000, 1370000, 1400000, 1430000,
			1470000, 1500000, 1540000, 1580000, 1620000, 1650000, 1690000, 1740000,
			1780000, 1820000, 1870000, 1910000, 1960000, 2000000, 2050000, 2100000,
			2150000, 2210000, 2260000, 2320000, 2370000, 2430000, 2490000, 2550000,
			2610000, 2670000, 2740000, 2800000, 2870000, 2940000, 3010000, 3090000,
			3160000, 3240000, 3320000, 3400000, 3480000, 3570000, 3650000, 3740000,
			3830000, 3920000, 4020000, 4120000, 4220000, 4320000, 4420000, 4530000,
			4640000, 4750000, 4870000, 4990000, 5110000, 5230000, 5360000, 5490000,
			5620000, 5760000, 5900000, 6040000, 6190000, 6340000, 6490000, 6650000,
			6810000, 6980000, 7150000, 7320000, 7500000, 7680000, 7870000, 8060000,
			8250000, 8450000, 8660000, 8870000, 9090000, 9310000, 9530000, 9760000,
			10000000, 10200000, 10500000, 10700000, 11000000, 11300000, 11500000, 11800000,
			12100000, 12400000, 12700000, 13000000, 13300000, 13700000, 14000000, 14300000,
			14700000, 15000000, 15400000, 15800000, 16200000, 16500000, 16900000, 17400000,
			17800000, 18200000, 18700000, 19100000, 19600000, 20000000, 20500000, 21000000,
			21500000, 22100000, 22600000, 23200000, 23700000, 24300000, 24900000, 25500000,
			26100000, 26700000, 27400000, 28000000, 28700000, 29400000, 30100000, 30900000,
			31600000, 32400000, 33200000, 34000000, 34800000, 35700000, 36500000, 37400000,
			38300000, 39200000, 40200000, 41200000, 42200000, 43200000, 44200000, 45300000,
			46400000, 47500000, 48700000, 49900000, 51100000, 52300000, 53600000, 54900000,
			56200000, 57600000, 59000000, 60400000, 61900000, 63400000, 64900000, 66500000,
			68100000, 69800000, 71500000, 73200000, 75000000, 76800000, 78700000, 80600000,
			82500000, 84500000, 86600000, 88700000, 90900000, 93100000, 95300000, 97600000
		];

	var z, E96, E96l, E96r;

	E96 = 0; E96l = 0; E96r = 0;

	// [ Шаг 1 ]
	// Ищем ближайшее стандартное.
	// Самое первое сопротивление!
	if (R1 < ArrayE96[0])
		{
		E96l = ArrayE96[0];
		}
		else
		{
		// [ Шаг 2 ]
		// Ищем ближайшее стандартное.
		// Самое последнее сопротивление!
		if (R1 > ArrayE96[767])
			{
			E96r = ArrayE96[767];
			}
			else
			{
			// [ Шаг 3 ]
			// Ищем ближайшее стандартное.
			// Проверим, может такое сопротивление есть в массиве!
			for(z = 0; z < ArrayE96.length; z++)
				{
				if (R1 == ArrayE96[z])
					{
					E96 = R1;
					break;
					}
				}

			if (E96 == 0)
				{
				// [ Шаг 4 ]
				// Ищем ближайшее стандартное.
				// Получаем значение слева и справа!
				for(z = 1; z < ArrayE96.length; z++)
					{
					if (ArrayE96[z] > R1)
						{
						// Слева.
						E96l = ArrayE96[z - 1];
						// Справа.
						E96r = ArrayE96[z];
						break;
						}
					}
				}
			}
		}

	// Самое первое сопротивление!
	// E96 = 0, E96l = Значение, E96r = 0.

	// Самое последнее сопротивление!
	// E96 = 0, E96l = 0, E96r = Значение.

	// Сопротивление есть в массиве!
	// E96 = Значение, E96l = 0, E96r = 0.

	// Ближайшее значение слева и справа!
	// E96 = 0, E96l = Значение слева, E96r = Значение справа

	// Возвращаем массив.
	return [E96, E96l, E96r];
}
