
// Написано в FreeBSD, Midnight Commander.
// Ukraine. (C) Demidov S.V.

// ----------------- //
// Кодирование VRLE8 //
// ----------------- //

//
// Общий сброс.
//
function VRLE8Reset()
{
	// Сбросить input file.
	VRLE8ResetInputFile();

	// Сбросить справочную информацию.
	VRLE8ResetReference();

	// Сбросить справочную информацию в Оценить.
	VRLE8ResetReferenceEstimate();

	// Сделать кнопку Оценить неактивной.
	VRLE8ResetEstimate();

	// Сбросить адреса, hex-данные, sym-данные.
	VRLE8ResetHex();

	// Установить имя файлу пусто и изменить цвет.
	VRLE8ResetFileName();

	// Сделать кнопку Сохранить VRLE8-файл неактивной.
	VRLE8ResetFileSave();
}

//
// Сбросить input file (выбор файла для кодирования).
// Если этого не сделать - Chrom, Opera отказываются
// после Сброса повторно грузить тот же самый файл! (!)
//
function VRLE8ResetInputFile()
{
	// Сбросить input file.
	document.getElementById('id_vrle8_f').value="";
}

//
// Сбросить справочную информацию.
//
function VRLE8ResetReference()
{

	// Сбросить справочную информацию, установить Нет данных.
	document.getElementById('id_vrle8_info_filename').innerHTML = "Нет данных";
		document.getElementById('id_vrle8_info_filesize').innerHTML = "Нет данных";
}

//
// Сбросить справочную информацию в Оценить.
//
function VRLE8ResetReferenceEstimate()
{

	var est = document.getElementById('id_vrle8_sum1').innerHTML;

	// Удалить \t (если есть).
	est = est.replace(/\t/g, "");
	// Удалить \n (если есть).
	est = est.replace(/\n/g, "");

	// Сбросить справочную информацию в Оценить.
	if (est != 'Нет данных')
		{
		// Сбросить справочную информацию, установить Нет данных.
		// В td стоит title="Нет данных"! Устанавливать title="Нет данных" не будем!
		document.getElementById('id_vrle8_sum1').innerHTML = "Нет данных";
			document.getElementById('id_vrle8_sum2').innerHTML = "Нет данных";
				document.getElementById('id_vrle8_cod_size').innerHTML = "Нет данных";
		}
}

//
// Сделать кнопку Оценить неактивной.
//
function VRLE8ResetEstimate()
{
	// Установить серый цвет.
	document.getElementById('id_vrle8_estimate').style.color = "#cccccc";
	// Удалить class sprgrf_inputfile.
	document.getElementById('id_vrle8_estimate').className = "";
	// Удалить title.
	document.getElementById('id_vrle8_estimate').title = "";

	// Удалить onClick (FireFox, Google Chrome).
	id_vrle8_estimate.setAttribute('onclick', '');
	// Удалить onClick (Internet Explorer).
	id_vrle8_estimate.onclick = function(){};
}

//
// Сбросить адреса, hex-данные, sym-данные.
//
function VRLE8ResetHex()
{
	// Сбросить адреса.
	document.getElementById('id_vrle8hex_1').innerHTML = "";

	var temp = "Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>";
			temp += "Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!<br>Пусто (Empty)!";

	// Сбросить hex-данные.
	document.getElementById('id_vrle8hex_2').innerHTML = temp;

	// Сбросить sym-данные.
	document.getElementById('id_vrle8hex_3').innerHTML = "";
}

//
// Установить имя файлу пусто и изменить цвет.
//
function VRLE8ResetFileName()
{
	// Вставить в страницу Пусто.
	document.getElementById('id_vrle8_filename').innerHTML = "Пусто";

	// Изменить цвет.
	document.getElementById('id_vrle8_filename').style.color = "#cccccc";
}

//
// Сделать кнопку Сохранить VRLE8-файл неактивной.
//
function VRLE8ResetFileSave()
{
	// Установить серый цвет.
	document.getElementById('id_vrle8_filesave').style.color = "#cccccc";
	// Удалить class sprgrf_inputfile.
	document.getElementById('id_vrle8_filesave').className = "";
	// Удалить title.
	document.getElementById('id_vrle8_filesave').title = "";

	// Удалить onClick (FireFox, Google Chrome).
	id_vrle8_filesave.setAttribute('onclick', '');
	// Удалить onClick (Internet Explorer).
	id_vrle8_filesave.onclick = function(){};
}

//
// Загрузка файла.
//
function VRLE8LoadFile(id)
{
	file = document.getElementById(id).files[0];
		reader = new FileReader();
			reader.readAsArrayBuffer(file);
				reader.onload = function()
					{
	var buffer = new Uint8Array(reader.result);

	// Вставить в страницу имя файла (с расширением).
	document.getElementById('id_vrle8_info_filename').innerHTML = "<b>" + file.name + "</b>";

	var bl = buffer.length;

	// Если нулевой файл то:
	if (bl == 0)
		{
		// вставить в страницу размер файла, вставить в страницу Ошибка!
		document.getElementById('id_vrle8_info_filesize').innerHTML = bl + " байт(а). <span class=\"vrle_fzeroerror\">Ошибка!</span>";
		// Прервать функцию.
		return;
		}

	// вставить в страницу размер файла.
	document.getElementById('id_vrle8_info_filesize').innerHTML = bl + " байт(а)";

	// Сбросить справочную информацию в Оценить.
	VRLE8ResetReferenceEstimate();

	var x, z, temp1, temp2, temp3, hex;

	// Вставить buffer в страницу (hex).

	temp1 = "";

	// Адреса hex.
	for (z = 0; z < bl;)
		{
		temp1 += z.toString(16);
		z = z + 16;

		// На последнем адресе не вставлять <br>.
		if (z < bl) { temp1 += "<br>"; }
		}

	x = 15; temp2 = "";

	// Данные hex.
	for (z = 0; z < bl;)
		{
		hex = buffer[z].toString(16);

		// Если нужно, дополнить нулём.
		if (hex.length == 1) { hex = "0" + hex; }

		// Начало строки (подсвечиваем при наведении).
		if (x == 15) { temp2 += "<span class=\"vrlestringbg\">"; }

		// Делаем title.
		temp2 += "<span title=\"Данные в Dec: " + buffer[z] + ". ";
		temp2 += "Адрес в Hex: " + z.toString(16) + ". Адрес в Dec: " + z + ".\">";
		temp2 += hex + "</span>";

		if (x == 0)
			{
			// Конец строки (завершаем подсвечивание при наведении).
			temp2 += "</span>";

			// На последнем байте не вставлять <br>.
			if (z != bl - 1) { temp2 += "<br>"; }

			x = 16;
			}
			else
			{
			// На последнем байте не вставлять пробел.
			if (z != bl - 1)
				{
				temp2 += " ";
				}
				else
				{
				// Конец строки (завершаем подсвечивание при наведении).
				temp2 += "</span>";
				}
			}
		x--;
		z++;
		}

	var byte;

	x = 15; temp3 = "";

	// Данные sym.
	for (z = 0; z < bl;)
		{
		byte = buffer[z];

		// Буквы: ABCDEFGHIJKLMNOPQRSTUVWXYZ.
		// Буквы: abcdefghijklmnopqrstuvwxyz.
		if ( (byte >= 0x41 && byte <= 0x5a) || (byte >= 0x61 && byte <= 0x7a) )
			{
			// Получаем символ по коду.
			temp3 += String.fromCharCode(byte);

			if (x == 0)
				{
				// На последнем sym не вставлять <br>.
				if (z != bl - 1) { temp3 += "<br>"; }

				x = 16;
				}
			}

		else

		// Цифры: 0123456789.
		if (byte >= 0x30 && byte <= 0x39)
			{
			// Получаем символ по коду.
			temp3 += String.fromCharCode(byte);

			if (x == 0)
				{
				// На последнем sym не вставлять <br>.
				if (z != bl - 1) { temp3 += "<br>"; }

				x = 16;
				}
			}

		else

		// Остальное: ~!@#$%^&*()_+=[]{},.?/\"'
		if (
			byte == 0x7e || byte == 0x21 || byte == 0x40 || byte == 0x23 || byte == 0x24 ||
			byte == 0x25 || byte == 0x5e || byte == 0x26 || byte == 0x2a || byte == 0x28 ||
			byte == 0x29 || byte == 0x5f || byte == 0x2b || byte == 0X3d || byte == 0x5b ||
			byte == 0x5d || byte == 0x7b || byte == 0x7d || byte == 0x2c || byte == 0x2e ||
			byte == 0x3f || byte == 0x2f || byte == 0x5c || byte == 0x22 || byte == 0x27)
			{

			// Получаем символ по коду.
			temp3 += String.fromCharCode(byte);

			if (x == 0)
				{
				// На последнем sym не вставлять <br>.
				if (z != bl - 1) { temp3 += "<br>"; }

				x = 16;
				}
			}

		else

		// Ещё пробел.
		if (byte == 0x20)
			{
			temp3 += "&nbsp;";

			if (x == 0)
				{
				// На последнем sym не вставлять <br>.
				if (z != bl - 1) { temp3 += "<br>"; }

				x = 16;
				}
			}
			else
			{
			// Иначе точка.
			temp3 += ".";

			if (x == 0)
				{
				// На последнем sym не вставлять <br>.
				if (z != bl - 1) { temp3 += "<br>"; }

				x = 16;
				}
			}
		x--;
		z++;
		}

	// Вставить в страницу адреса.
	document.getElementById('id_vrle8hex_1').innerHTML = temp1;

	// Вставить в страницу hex-данные.
	document.getElementById('id_vrle8hex_2').innerHTML = temp2;

	// Вставить в страницу sym-данные.
	document.getElementById('id_vrle8hex_3').innerHTML = temp3;

	temp1 = "";
		temp2 = "";
			temp3 = "";

	// Вставить в страницу имя VRLE8-файла.
	document.getElementById('id_vrle8_filename').innerHTML = file.name + '.vrle8';

	// Изменить цвет имени.
	document.getElementById('id_vrle8_filename').style.color = "#333333";

	// Активировать кнопку Оценить.
	id_vrle8_estimate.setAttribute('style', ''); // Удалить серый цвет.
		document.getElementById('id_vrle8_estimate').className = "vrle_estimate2"; // Установить class vrle_estimate2.
		document.getElementById('id_vrle8_estimate').title = "Нажмите"; // Установить title.
			id_vrle8_estimate.setAttribute('onclick', 'VRLE8Estimate();'); // Установить onClick (FireFox, Google Chrome).
			id_vrle8_estimate.onclick = function(){VRLE8Estimate();}; // Установить onClick (Internet Explorer).

	// Активировать кнопку Сохранить VRLE8-файл.
	id_vrle8_filesave.setAttribute('style', ''); // Удалить серый цвет.
		document.getElementById('id_vrle8_filesave').className = "vrle_save"; // Установить class vrle_save.
		document.getElementById('id_vrle8_filesave').title = "Нажмите"; // Установить title.
			id_vrle8_filesave.setAttribute('onclick', 'VRLE8Save();'); // Установить onClick (FireFox, Google Chrome).
			id_vrle8_filesave.onclick = function(){VRLE8Save();}; // Установить onClick (Internet Explorer).
	}
}

//
// Сохраняем VRLE8-файл.
//
function VRLE8Save()
{
	var temp, z;

	// Массив с hex-данными (символьный массив).
	var array1 = [];

	// Массив с данными (числовой массив, каждая ячейка от 0 и до 255, байты).
	// Это то, что нужно закодировать.
	var array2 = [];

	 // Массив с адресами повтор./неповтор (числовой массив).
	var array3 = [];

	 // Массив с закодированными данными.
	var array4 = [];

	// Здесь заголовок: VRLE8, зарезервированный байт (0), дальше идут закодированные байты.
	var array5 = [];

	// Получить hex-данные.
	temp = document.getElementById('id_vrle8hex_2').innerHTML;

	// Удалить все пробелы.
	temp = temp.replace(/ /g, "");

	// Удалить теги.
	temp = temp.replace(/<[^>]+>/g, '');

	// По два символа в массив.
	array1 = temp.match(/.{1,2}/g);

	// Создаём числовой массив.
	for (z = 0; z < array1.length;)
		{
		array2[z] = Number("0x" + array1[z]);
		z++;
		}

	// Возвращает массив с адресами.
	array3 = VRLE8BuildArrayAddr8(array2);

// ---

	// Считаем байты, сколько повтор и сколько неповтор.
//	var b = VRLE8CountingBytes8(array3);

//	var b1, b2, b3;

//	b1 = b[0];
//	b2 = b[1];

	// Всех байт.
//	b3 = b1 + b2;

	// Для проверки.
//	alert("Повтор. (разные) " + b1 + ". " + "Неповтор. " + b2 + ". " + "Всех байт " + b3 + ".");

// ---

	// Закодировать данные.
	array4 = VRLE8Coding(array2, array3);

	// Добавляем заголовок.
	//
	//    0x56 - V
	//    0x52 - R
	//    0x4c - L
	//    0x45 - E
	//    0x38 - 8
	//       0 - Зарезервированный байт.
	//
	array5 = [0x56, 0x52, 0x4c, 0x45, 0x38, 0];

	// Объединяем два массива.
	var array45 = [].concat(array5, array4);

	// Для проверки.
//	alert(array4);

	// Для проверки.
//	alert(array5);

	// Типизированный массив.
	var buf = new Uint8Array(array45);

	// Получаем имя VRLE8-файла.
	var nameVRLE8 = document.getElementById('id_vrle8_filename').innerHTML;

	// Записываем закодированный файл на диск.

	// -
	var txt = navigator.userAgent;

	if (txt.search(/rv:11.0/) > 0)
		{
		// Internet Explorer 11.
		var file = new Blob([buf], {type: "application/octet-stream"});
		window.navigator.msSaveOrOpenBlob (file, nameVRLE8);
		}
		else
		{
		// FireFox, Opera, Google Chrome и др.
		var blob = new Blob([buf], {type: "application/octet-stream"});
		var link = document.createElement("a");
		link.setAttribute("href", URL.createObjectURL(blob));
		link.setAttribute("download", nameVRLE8);
		link.click();
		}
}

//
// Построить массив с адресами (повтор. и неповтор.).
//
//                       -------------------------
//    Возвращает массив: | x | addr1 | addr2 | y | ... ... ... и т.д.
//                       -------------------------
//
//      x = 0 - означает неповтор;
//      x = 1 - означает повтор;
//      addr1 - начальный адрес повтор./неповтор;
//      addr2 - конечный адрес повтор./неповтор;
//          y - сколько повтор./неповтор.
//
function VRLE8BuildArrayAddr8(buffer)
{

// buffer - это массив с числами (каждая ячейка от 0 и до 255, байты)!
// buffer - это тот массив, который нужно будет "подсунуть" кодировщику!

//
// Как могут располагаться повтор.
//
//    0, 0, 1, 2, 3, 4 => В начале.
//    1, 2, 3, 4, 0, 0 => В конце.
//    1, 2, 0, 0, 1, 2 => Внутри.
//    0, 0, 0, 0, 0, 0 => Только одни повтор.
//    0, 0, 1, 1, 2, 3 => Стоящие рядом.
//
// Как могут располагаться неповтор.
//
//    1, 2, 0, 0, 0, 0 => В начале.
//    0, 0, 0, 0, 1, 2 => В конце.
//    0, 0, 1, 2, 0, 0 => Внутри.
//    1, 2, 3, 4, 5, 6 => Только одни неповтор.
//
//    С одним байтом.
//
//    1, 0, 0, 0, 0, 0 => В начале.
//    0, 0, 0, 0, 0, 1 => В конце.
//    0, 0, 1, 0, 0, 0 => Внутри.
//

	var array1 = []; // Выходной массив с адресами повтор. и неповтор.

	var x, z, z1, zz, bl, aaddr1;

	// Размер buffer'а.
	bl = buffer.length;

	aaddr1 = 0;

	if (bl == 1)
		{
		// buffer содержит всего 1 байт.

		z = 0; zz = z; x = 1;

		// Для проверки.
//		alert("Адрес первого неповтор. " + zz + ". " + "Адрес последнего неповтор. " + z + ". " + "Сколько неповтор. " + x + ".");

		// В массив указатель на неповтор.
		array1[aaddr1++] = 0;
		// В массив адрес первого неповтор.
		array1[aaddr1++] = zz;
		// В массив адрес последнего неповтор.
		array1[aaddr1++] = z;
		// В массив сколько неповтор.
		array1[aaddr1] = x;
		}
		else
		{
		for (z = 0;;) // Бесконечный цикл.
			{
			// Достигнут конец buffer'а.
			if (z == bl)
				{
				// Прервать цикл.
				break;
				}

			// В конце buffer'а один байт.
			if (z == bl - 1)
				{
				zz = z; x = 1;

				// Для проверки.
//				 alert("Адрес первого неповтор. " + zz + ". " + "Адрес последнего неповтор. " + z + ". " + "Сколько неповтор. " + x + ".");

				// В массив указатель на неповтор.
				array1[aaddr1++] = 0;
				// В массив адрес первого неповтор.
				array1[aaddr1++] = zz;
				// В массив адрес последнего неповтор.
				array1[aaddr1++] = z;
				// В массив сколько неповтор.
				array1[aaddr1] = x;

				// Прервать цикл.
				break;
				}

			// Один раз можно выполнить if, а потом сделать через switch.
			// Надо подумать!
			if (buffer[z] == buffer[z + 1])
				{
				// Повторяющиеся.

				// В zz адрес первого повтор.
				zz = z;

				// Запомнить в z1.
				z1 = buffer[z];

				for (x = 1;;) // Бесконечный цикл.
					{
					// Достигнут конец buffer'а.
					if (z == bl - 1)
						{
						// Прервать цикл.
						break;
						}

					// Если идут повтор., то считаем их.
					if (z1 == buffer[z + 1])
						{
						z++;

						// В x сколько повтор.
						x++;
						}
						else
						{
						// Прервать цикл.
						break;
						}
					}

				// Для проверки.
//				 alert("Адрес первого повтор. " + zz + ". " + "Адрес последнего повтор. " + z + ". " + "Сколько повтор. " + x + ".");

				// В массив указатель на повтор.
				array1[aaddr1++] = 1;
				// В массив адрес первого повтор.
				array1[aaddr1++] = zz;
				// В массив адрес последнего повтор.
				array1[aaddr1++] = z;
				// В массив сколько повтор.
				array1[aaddr1++] = x;
				}
				else
				{
				// Неповторяющиеся.

				// В zz адрес первого неповтор.
				zz = z;

				for (x = 1;;) // Бесконечный цикл.
					{
					// Достигнут конец buffer'а.
					if (z == bl - 1)
						{
						// Прервать цикл.
						break;
						}

					// Продолжаем искать повтор.
					if (buffer[z] == buffer[z + 1])
						{
						// Откатится назад (к концу неповтор.).
						x--;
						z--;

						// Прервать цикл.
						break;
						}
						else
						{
						z++;

						// В x сколько неповтор.
						x++;
						}
					}

				// Для проверки.
//				 alert("Адрес первого неповтор. " + zz + ". " + "Адрес последнего неповтор. " + z + ". " + "Сколько неповтор. " + x + ".");

				// В массив указатель на неповтор.
				array1[aaddr1++] = 0;
				// В массив адрес первого неповтор.
				array1[aaddr1++] = zz;
				// В массив адрес последнего неповтор.
				array1[aaddr1++] = z;
				// В массив сколько неповтор.
				array1[aaddr1++] = x;
				}
			z++;
			}
		}

	return array1;
}

//
// Считаем байты. Считаем сколько повтор. и сколько неповтор.
// Информацию берём из массива с адресами.
//
function VRLE8CountingBytes8(array)
{
	var b1, b2, z;

	b1 = 0; // Повтор. (разные).
	b2 = 0; // Неповтор.

	// Считаем повтор. и неповтор.

	for (z = 0; z < array.length;)
		{
		if (array[z] == 1)
			{
			// Повтор. (разные).
			z = z + 3;

			b1 = b1 + array[z++];
			}
			else
			{
			// Неповтор.
			z = z +3;

			b2 = b2 + array[z++];
			}
		}

	return [b1, b2];
}

//
// Кодируем данные.
// Исправленный вариант.
//
// Есть цепочка байт повтор. и неповтор.
// Как правильно порезать одну большую порцию > 127 байт?
//
//    Количество байт < 127 - часть порции
//    Количество байт = 127 - n-полных порций (n-максимальных порций)
//    Количество байт > 127 - n-полных порций и часть порции
//
function VRLE8Coding(array1, array2)
{

	// array1 - Массив с данными (числовой массив, каждая ячейка от 0 и до 255, байты).
	//          Это то, что нужно закодировать.

	// array2 - Массив с адресами повтор./неповтор. (числовой массив).

	// Кодируем в arraycoding8.
	var arraycoding8 = [];

	var addr2, addrcoding, z1, z2, z3, b1;
	var tpor1, tpor2, swpor, t1, t2, z4;

	addrcoding = 0;

	for (addr2 = 0; addr2 < array2.length;)
		{
		// Кодирование.
		switch (array2[addr2])
			{

			// -------
			// Повтор.
			// -------

			// Минимальная порция - 2 байта.
			// Максимальная порция - 127 байт.

			case 1:

			// Байт, который нужно повторить.
			b1 = array1[array2[addr2 + 1]];

			tpor1 = array2[addr2 + 3]; // Сколько повтор.

			if (tpor1 < 127)
				{
				// Только часть порции.
				// В tpor1 - сколько повтор.
				swpor = 1;
				}
				else
				{
				t1 = 0;

				for(;;)
					{
					tpor1 = tpor1 - 127;
					t1++;

					if (tpor1 == 0)
						{
						// n-полных порций и нет неполной порции.
						// В t1 - сколько полных порций.
						swpor = 2;
						break;
						}

					if (tpor1 < 127)
						{
						// n-полных порций и часть порции.
						// В t1 - сколько полных порций.
						// В tpor1 - часть порции (сколько повтор.).
						swpor = 3;
						break;
						}
					}
				}

			switch (swpor)
				{
				case 1:

				// Логическое ИЛИ (|):
				//    0 0 | 0
				//    0 1 | 1
				//    1 0 | 1
				//    1 1 | 1

				// Только часть порции.

				// Записываем информационный байт.
				// Установить 7-й бит в 1, остальные биты оставить без изменений.
				arraycoding8[addrcoding++] = 128 | tpor1;

				// Записываем байт, который нужно повторить.
				arraycoding8[addrcoding++] = b1;

				break;

				case 2:

				// Только полная порция (полные порции).
				for (z1 = 0; z1 < t1;)
					{
					// Записываем информационный байт.
					// 7-й бит в 1 (7F => FF)!
					arraycoding8[addrcoding++] = 255;

					// Записываем байт, который нужно повторить.
					arraycoding8[addrcoding++] = b1;

					z1++;
					}

				break;

				case 3:

				// Полная порция (полные порции).
				for (z1 = 0; z1 < t1;)
					{
					// Записываем информационный байт.
					// 7-й бит в 1 (7F => FF)!
					arraycoding8[addrcoding++] = 255;

					// Записываем байт, который нужно повторить.
					arraycoding8[addrcoding++] = b1;

					z1++;
					}

				// Часть порции (остаток).

				// Записываем информационный байт.
				// Установить 7-й бит в 1, остальные биты оставить без изменений.
				arraycoding8[addrcoding++] = 128 | tpor1;

				// Записываем байт, который нужно повторить.
				arraycoding8[addrcoding++] = b1;

				break;
				}

			break;

			// ---------
			// Неповтор.
			// ---------

			// Минимальная порция - 1 байт.
			// Максимальная порция - 127 байт.

			case 0:

			// Начальный адрес неповтор.
			z3 = array2[addr2 + 1];

			tpor2 = array2[addr2 + 3]; // Сколько неповтор.

			if (tpor2 < 127)
				{
				// Только часть порции.
				// В tpor2 - сколько неповтор.
				swpor = 1;
				}
				else
				{
				t2 = 0;

				for(;;)
					{
					tpor2 = tpor2 - 127;
					t2++;

					if (tpor2 == 0)
						{
						// n-полных порций и нет неполной порции.
						// В t2 - сколько полных порций.
						swpor = 2;
						break;
						}

					if (tpor2 < 127)
						{
						// n-полных порций и часть порции.
						// В t2 - сколько полных порций.
						// В tpor2 - часть порции (сколько неповтор.).
						swpor = 3;
						break;
						}
					}
				}

			switch (swpor)
				{
				case 1:

				// Записываем информационный байт.
				// 7-й бит уже в 0!
				arraycoding8[addrcoding++] = tpor2;

				// Только часть порции.
				for (z2 = 0; z2 < tpor2;)
					{
					// Переписываем неповтор. байты.
					arraycoding8[addrcoding++] = array1[z3++];
					z2++;
					}

				break;

				case 2:

				// Только полная порция (только полные порции).
				for (z4 = 0; z4 < t2;)
					{
					// Записываем информационный байт.
					// Максимальный размер порции, плюс 7-й бит в 0.
					arraycoding8[addrcoding++] = 127;

					for (z2 = 0; z2 < 127;)
						{
						// Переписываем неповтор. байты.
						arraycoding8[addrcoding++] = array1[z3++];
						z2++;
						}
					z4++;
					}

				break;

				case 3:

				// Полная порция (полные порции).
				for (z4 = 0; z4 < t2;)
					{
					// Записываем информационный байт.
					// Максимальный размер порции, плюс 7-й бит в 0.
					arraycoding8[addrcoding++] = 127;

					for (z2 = 0; z2 < 127;)
						{
						// Переписываем неповтор. байты.
						arraycoding8[addrcoding++] = array1[z3++];
						z2++;
						}
					z4++;
					}

				// Часть порции (остаток).

				// Записываем информационный байт.
				// 7-й бит уже в 0!
				arraycoding8[addrcoding++] = tpor2;

				for (z2 = 0; z2 < tpor2;)
					{
					// Переписываем неповтор. байты.
					arraycoding8[addrcoding++] = array1[z3++];
					z2++;
					}

				break;
				}

			// Прервать switch;
			break;
			}
		addr2 = addr2 + 4;
		}

	// Вернуть закодированный массив.
	return arraycoding8;
}

//
// Оценить.
//
function VRLE8Estimate()
{
	 // Массив с hex-данными (символьный массив).
	var array1 = [];

	// Массив с данными (числовой массив, каждая ячейка от 0 и до 255, байты).
	// Это то, что нужно оценить.
	var array2 = [];

	// Массив с адресами повтор./неповтор (числовой массив).
	var array3 = [];

	var temp, z, tcb;

	// Получить hex-данные.
	temp = document.getElementById('id_vrle8hex_2').innerHTML;

	// Удалить все пробелы.
	temp = temp.replace(/ /g, "");

	// Удалить теги.
	temp = temp.replace(/<[^>]+>/g, '');

	// По два символа в массив.
	array1 = temp.match(/.{1,2}/g);

	// Создаём числовой массив.
	for (z = 0; z < array1.length;)
		{
		array2[z] = Number("0x" + array1[z]);
		z++;
		}

	// Возвращает массив с адресами.
	array3 = VRLE8BuildArrayAddr8(array2);

	// Считаем байты, сколько повтор и сколько неповтор.
	var b = VRLE8CountingBytes8(array3);

	var b1, b2, b3;

	b1 = b[0];
	b2 = b[1];

	// Всех байт.
	b3 = b1 + b2;

	// Для проверки.
	// alert("Повтор. (разные) " + b1 + ". " + "Неповтор. " + b2 + ". " + "Всех байт " + b3 + ".");

	// Вставиить в страницу сколько всех повтор.
	document.getElementById('id_vrle8_sum1').innerHTML = "<span title=\"" + b1 +" + " + b2 + " = " + (b1 + b2) + " байт(а)" + "\">" + b1 + " байт(а)</span>";

	// Вставиить в страницу сколько всех неповтор.
	document.getElementById('id_vrle8_sum2').innerHTML = "<span title=\"" + b1 +" + " + b2 + " = " + (b1 + b2) + " байт(а)" + "\">" + b2 + " байт(а)</span>";

	// Считаем сколько будет весить закодированный файл.
	tcb = VRLE8CodingEstimate(array2, array3);

	var x, y, txt;

	// Получить размер файла (незакодированный).
	txt = document.getElementById('id_vrle8_info_filesize').innerHTML;

	// В x размер файла.
	x = Number(txt.substr(0, txt.indexOf(' ')));

	// Учитываем заголовок - 6 байт!

	// Если размер закодированного файла меньше исходного.
	if ((tcb + 6) < x)
		{
		y = x - (tcb + 6);
		txt = "Меньше на " + y + " байт(а)";
		}

	// Если размер закодированного файла больше исходного.
	if ((tcb + 6) > x)
		{
		y = (tcb + 6) - x;
		txt = "Больше на " + y + " байт(а)";
		}

	// Если исходный файл и закодированный - равны.
	if ((tcb + 6) == x)
		{
		txt = "Исходный файл и закодированный - равны";
		}

	// Вставить в страницу размер закодированного файла.
	// Размер файла, включая заголовок 6 байт.
	document.getElementById('id_vrle8_cod_size').innerHTML = "<span title=\"" + txt + "\">" + (tcb + 6) + " байт(а)</span>";
}

//
//
// Оценка данных.
//
function VRLE8CodingEstimate(array1, array2)
{

	// array1 - Массив с данными (числовой массив, каждая ячейка от 0 и до 255, байты).
	//          Это то, что нужно оценить.

	// array2 - Массив с адресами повтор./неповтор (числовой массив).

	var addr2, z1, z4, tpor1, tpor2, swpor, t1, t2, tcb;

	tcb = 0;

	for (addr2 = 0; addr2 < array2.length;)
		{
		// Оценка.
		switch (array2[addr2])
			{

			// -------
			// Повтор.
			// -------

			// Минимальная порция - 2 байта.
			// Максимальная порция - 127 байт.

			case 1:

			tpor1 = array2[addr2 + 3]; // Сколько повтор.

			if (tpor1 < 127)
				{
				// Только часть порции.
				// В tpor1 - сколько повтор.
				swpor = 1;
				}
				else
				{
				t1 = 0;

				for(;;)
					{
					tpor1 = tpor1 - 127;
					t1++;

					if (tpor1 == 0)
						{
						// n-полных порций и нет неполной порции.
						// В t1 - сколько полных порций.
						swpor = 2;
						break;
						}

					if (tpor1 < 127)
						{
						// n-полных порций и часть порции.
						// В t1 - сколько полных порций.
						// В tpor1 - часть порции (сколько повтор.).
						swpor = 3;
						break;
						}
					}
				}

			switch (swpor)
				{
				case 1:

				// Только часть порции.
				tcb++;
				tcb++;

				break;

				case 2:

				// Только полная порция (полные порции).
				for (z1 = 0; z1 < t1;)
					{
					tcb++;
					tcb++;

					z1++;
					}

				break;

				case 3:

				// Полная порция (полные порции).
				for (z1 = 0; z1 < t1;)
					{
					tcb++;
					tcb++;

					z1++;
					}

				// Часть порции.
				tcb++;
				tcb++;

				break;
				}

			break;

			// ---------
			// Неповтор.
			// ---------

			// Минимальная порция - 1 байт.
			// Максимальная порция - 127 байт.

			case 0:

			tpor2 = array2[addr2 + 3]; // Сколько неповтор.

			if (tpor2 < 127)
				{
				// Только часть порции.
				// В tpor2 - сколько неповтор.
				swpor = 1;
				}
				else
				{
				t2 = 0;

				for(;;)
					{
					tpor2 = tpor2 - 127;
					t2++;

					if (tpor2 == 0)
						{
						// n-полных порций и нет неполной порции.
						// В t2 - сколько полных порций.
						swpor = 2;
						break;
						}

					if (tpor2 < 127)
						{
						// n-полных порций и часть порции.
						// В t2 - сколько полных порций.
						// В tpor2 - часть порции (сколько неповтор.).
						swpor = 3;
						break;
						}
					}
				}

			switch (swpor)
				{
				case 1:

				// Только часть порции.
				tcb++;
				tcb = tcb + tpor2;

				break;

				case 2:

				// Только полная порция (только полные порции).
				for (z4 = 0; z4 < t2;)
					{
					tcb++;
					tcb = tcb + 127;

					z4++;
					}

				break;

				case 3:

				// Полная порция (полные порции).
				for (z4 = 0; z4 < t2;)
					{
					tcb++;
					tcb = tcb + 127;

					z4++;
					}

				// Часть порции.
				tcb++;
				tcb = tcb + tpor2;

				break;
				}

			// Прервать switch;
			break;
			}
		addr2 = addr2 + 4;
		}

	return tcb;
}

//
// Функция 1. Построить массив с адресами (функция написана на JS), для вставки в страницу (в index.html).
// Функция 2. Кодируем данные (функция нвписана на JS), для вставки в страницу (в index.html).
//
function VRLE8cPrgJS()
{

// 1.
// Функция создаёт массив с адресами.

var ArrayPRG1 =
[

"002f","002f","000a","002f","002f","0020","041f","043e","0441","0442","0440","043e","0438","0442","044c","0020",
"043c","0430","0441","0441","0438","0432","0020","0441","0020","0430","0434","0440","0435","0441","0430","043c",
"0438","0020","0028","043f","043e","0432","0442","043e","0440","002e","0020","0438","0020","043d","0435","043f",
"043e","0432","0442","043e","0440","0029","002e","000a","002f","002f","000a","002f","002f","0020","0020","0020",
"0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020",
"0020","0020","0020","0020","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d",
"002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","000a","002f","002f",
"0020","0020","0020","0020","0412","043e","0437","0432","0440","0430","0449","0430","0435","0442","0020","043c",
"0430","0441","0441","0438","0432","003a","0020","007c","0020","0078","0020","007c","0020","0061","0064","0064",
"0072","0031","0020","007c","0020","0061","0064","0064","0072","0032","0020","007c","0020","0079","0020","007c",
"0020","002e","002e","002e","0020","002e","002e","002e","0020","002e","002e","002e","0020","0438","0020","0442",
"002e","0434","002e","000a","002f","002f","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020",
"0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","002d","002d","002d",
"002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d","002d",
"002d","002d","002d","002d","002d","002d","000a","002f","002f","000a","002f","002f","0020","0020","0020","0020",
"0020","0020","0078","0020","003d","0020","0030","0020","002d","0020","043e","0437","043d","0430","0447","0430",
"0435","0442","0020","043d","0435","043f","043e","0432","0442","043e","0440","003b","000a","002f","002f","0020",
"0020","0020","0020","0020","0020","0078","0020","003d","0020","0031","0020","002d","0020","043e","0437","043d",
"0430","0447","0430","0435","0442","0020","043f","043e","0432","0442","043e","0440","003b","000a","002f","002f",
"0020","0020","0020","0020","0020","0020","0061","0064","0064","0072","0031","0020","002d","0020","043d","0430",
"0447","0430","043b","044c","043d","044b","0439","0020","0430","0434","0440","0435","0441","0020","043f","043e",
"0432","0442","043e","0440","002e","002f","043d","0435","043f","043e","0432","0442","043e","0440","003b","000a",
"002f","002f","0020","0020","0020","0020","0020","0020","0061","0064","0064","0072","0032","0020","002d","0020",
"043a","043e","043d","0435","0447","043d","044b","0439","0020","0430","0434","0440","0435","0441","0020","043f",
"043e","0432","0442","043e","0440","002e","002f","043d","0435","043f","043e","0432","0442","043e","0440","003b",
"000a","002f","002f","0020","0020","0020","0020","0020","0020","0020","0020","0020","0020","0079","0020","002d",
"0020","0441","043a","043e","043b","044c","043a","043e","0020","043f","043e","0432","0442","043e","0440","002e",
"002f","043d","0435","043f","043e","0432","0442","043e","0440","002e","000a","002f","002f","000a","0066","0075",
"006e","0063","0074","0069","006f","006e","0020","0042","0075","0069","006c","0064","0041","0072","0072","0061",
"0079","0041","0064","0064","0072","0038","0028","0062","0075","0066","0066","0065","0072","0029","000a","007b",
"000a","000a","002f","002f","0020","0062","0075","0066","0066","0065","0072","0020","002d","0020","044d","0442",
"043e","0020","043c","0430","0441","0441","0438","0432","0020","0441","0020","0447","0438","0441","043b","0430",
"043c","0438","0020","0028","043a","0430","0436","0434","0430","044f","0020","044f","0447","0435","0439","043a",
"0430","0020","043e","0442","0020","0030","0020","0438","0020","0434","043e","0020","0032","0035","0035","002c",
"0020","0431","0430","0439","0442","044b","0029","0021","000a","002f","002f","0020","0062","0075","0066","0066",
"0065","0072","0020","002d","0020","044d","0442","043e","0020","0442","043e","0442","0020","043c","0430","0441",
"0441","0438","0432","002c","0020","043a","043e","0442","043e","0440","044b","0439","0020","043d","0443","0436",
"043d","043e","0020","0431","0443","0434","0435","0442","0020","0022","043f","043e","0434","0441","0443","043d",
"0443","0442","044c","0022","000a","002f","002f","0020","0020","0020","0020","0020","0020","0020","0020","0020",
"0020","043a","043e","0434","0438","0440","043e","0432","0449","0438","043a","0443","0020","0028","043a","043e",
"0434","0438","0440","043e","0432","0449","0438","043a","0020","0441","043c","002e","0020","043d","0438","0436",
"0435","0029","002e","000a","000a","002f","002f","000a","002f","002f","0020","041a","0430","043a","0020","043c",
"043e","0433","0443","0442","0020","0440","0430","0441","043f","043e","043b","0430","0433","0430","0442","044c",
"0441","044f","0020","043f","043e","0432","0442","043e","0440","002e","000a","002f","002f","000a","002f","002f",
"0020","0020","0020","0020","0030","002c","0020","0030","002c","0020","0031","002c","0020","0032","002c","0020",
"0033","002c","0020","0034","0020","003d","003e","0020","0412","0020","043d","0430","0447","0430","043b","0435",
"002e","000a","002f","002f","0020","0020","0020","0020","0031","002c","0020","0032","002c","0020","0033","002c",
"0020","0034","002c","0020","0030","002c","0020","0030","0020","003d","003e","0020","0412","0020","043a","043e",
"043d","0446","0435","002e","000a","002f","002f","0020","0020","0020","0020","0031","002c","0020","0032","002c",
"0020","0030","002c","0020","0030","002c","0020","0031","002c","0020","0032","0020","003d","003e","0020","0412",
"043d","0443","0442","0440","0438","002e","000a","002f","002f","0020","0020","0020","0020","0030","002c","0020",
"0030","002c","0020","0030","002c","0020","0030","002c","0020","0030","002c","0020","0030","0020","003d","003e",
"0020","0422","043e","043b","044c","043a","043e","0020","043e","0434","043d","0438","0020","043f","043e","0432",
"0442","043e","0440","002e","000a","002f","002f","0020","0020","0020","0020","0030","002c","0020","0030","002c",
"0020","0031","002c","0020","0031","002c","0020","0032","002c","0020","0033","0020","003d","003e","0020","0421",
"0442","043e","044f","0449","0438","0435","0020","0440","044f","0434","043e","043c","002e","000a","002f","002f",
"000a","002f","002f","0020","041a","0430","043a","0020","043c","043e","0433","0443","0442","0020","0440","0430",
"0441","043f","043e","043b","0430","0433","0430","0442","044c","0441","044f","0020","043d","0435","043f","043e",
"0432","0442","043e","0440","002e","000a","002f","002f","000a","002f","002f","0020","0020","0020","0020","0031",
"002c","0020","0032","002c","0020","0030","002c","0020","0030","002c","0020","0030","002c","0020","0030","0020",
"003d","003e","0020","0412","0020","043d","0430","0447","0430","043b","0435","002e","000a","002f","002f","0020",
"0020","0020","0020","0030","002c","0020","0030","002c","0020","0030","002c","0020","0030","002c","0020","0031",
"002c","0020","0032","0020","003d","003e","0020","0412","0020","043a","043e","043d","0446","0435","002e","000a",
"002f","002f","0020","0020","0020","0020","0030","002c","0020","0030","002c","0020","0031","002c","0020","0032",
"002c","0020","0030","002c","0020","0030","0020","003d","003e","0020","0412","043d","0443","0442","0440","0438",
"002e","000a","002f","002f","0020","0020","0020","0020","0031","002c","0020","0032","002c","0020","0033","002c",
"0020","0034","002c","0020","0035","002c","0020","0036","0020","003d","003e","0020","0422","043e","043b","044c",
"043a","043e","0020","043e","0434","043d","0438","0020","043d","0435","043f","043e","0432","0442","043e","0440",
"002e","000a","002f","002f","000a","002f","002f","0020","0020","0020","0020","0421","0020","043e","0434","043d",
"0438","043c","0020","0431","0430","0439","0442","043e","043c","002e","000a","002f","002f","000a","002f","002f",
"0020","0020","0020","0020","0031","002c","0020","0030","002c","0020","0030","002c","0020","0030","002c","0020",
"0030","002c","0020","0030","0020","003d","003e","0020","0412","0020","043d","0430","0447","0430","043b","0435",
"002e","000a","002f","002f","0020","0020","0020","0020","0030","002c","0020","0030","002c","0020","0030","002c",
"0020","0030","002c","0020","0030","002c","0020","0031","0020","003d","003e","0020","0412","0020","043a","043e",
"043d","0446","0435","002e","000a","002f","002f","0020","0020","0020","0020","0030","002c","0020","0030","002c",
"0020","0031","002c","0020","0030","002c","0020","0030","002c","0020","0030","0020","003d","003e","0020","0412",
"043d","0443","0442","0440","0438","002e","000a","002f","002f","000a","000a","0009","0076","0061","0072","0020",
"0061","0072","0072","0061","0079","0031","0020","003d","0020","005b","005d","003b","0020","002f","002f","0020",
"0412","044b","0445","043e","0434","043d","043e","0439","0020","043c","0430","0441","0441","0438","0432","0020",
"0441","0020","0430","0434","0440","0435","0441","0430","043c","0438","0020","043f","043e","0432","0442","043e",
"0440","002e","0020","0438","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e","000a","000a",
"0009","0076","0061","0072","0020","0062","006c","002c","0020","0061","0061","0064","0064","0072","0031","002c",
"0020","0061","0064","0064","0072","0032","002c","0020","0061","0064","0064","0072","0033","002c","0020","0074",
"006f","0074","0061","006c","002c","0020","0070","0031","003b","000a","000a","0009","002f","002f","0020","0420",
"0430","0437","043c","0435","0440","0020","0062","0075","0066","0066","0065","0072","0027","0430","002e","000a",
"0009","0062","006c","0020","003d","0020","0062","0075","0066","0066","0065","0072","002e","006c","0065","006e",
"0067","0074","0068","003b","000a","000a","0009","0061","0061","0064","0064","0072","0031","0020","003d","0020",
"0030","003b","000a","000a","0009","0069","0066","0020","0028","0062","006c","0020","003d","003d","0020","0031",
"0029","000a","0009","0009","007b","000a","0009","0009","002f","002f","0020","0062","0075","0066","0066","0065",
"0072","0020","0441","043e","0434","0435","0440","0436","0438","0442","0020","0432","0441","0435","0433","043e",
"0020","0031","0020","0431","0430","0439","0442","002e","000a","000a","0009","0009","0061","0064","0064","0072",
"0033","0020","003d","0020","0030","003b","0020","0061","0064","0064","0072","0032","0020","003d","0020","0061",
"0064","0064","0072","0033","003b","0020","0074","006f","0074","0061","006c","0020","003d","0020","0031","003b",
"000a","000a","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020",
"0443","043a","0430","0437","0430","0442","0435","043b","044c","0020","043d","0430","0020","043d","0435","043f",
"043e","0432","0442","043e","0440","002e","000a","0009","0009","0061","0072","0072","0061","0079","0031","005b",
"0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0030","003b","000a","0009",
"0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0430","0434","0440",
"0435","0441","0020","043f","0435","0440","0432","043e","0433","043e","0020","043d","0435","043f","043e","0432",
"0442","043e","0440","002e","000a","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061",
"0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0061","0064","0064","0072","0032","003b",
"000a","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0430",
"0434","0440","0435","0441","0020","043f","043e","0441","043b","0435","0434","043d","0435","0433","043e","0020",
"043d","0435","043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0061","0072","0072","0061",
"0079","0031","005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0061",
"0064","0064","0072","0033","003b","000a","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441",
"0441","0438","0432","0020","0441","043a","043e","043b","044c","043a","043e","0020","043d","0435","043f","043e",
"0432","0442","043e","0440","002e","000a","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061",
"0061","0064","0064","0072","0031","005d","0020","003d","0020","0074","006f","0074","0061","006c","003b","000a",
"0009","0009","007d","000a","0009","0009","0065","006c","0073","0065","000a","0009","0009","007b","000a","0009",
"0009","0066","006f","0072","0020","0028","0061","0064","0064","0072","0033","0020","003d","0020","0030","003b",
"003b","0029","0020","002f","002f","0020","0411","0435","0441","043a","043e","043d","0435","0447","043d","044b",
"0439","0020","0446","0438","043a","043b","002e","000a","0009","0009","0009","007b","000a","0009","0009","0009",
"002f","002f","0020","0414","043e","0441","0442","0438","0433","043d","0443","0442","0020","043a","043e","043d",
"0435","0446","0020","0062","0075","0066","0066","0065","0072","0027","0430","002e","000a","0009","0009","0009",
"0069","0066","0020","0028","0061","0064","0064","0072","0033","0020","003d","003d","0020","0062","006c","0029",
"000a","0009","0009","0009","0009","007b","000a","0009","0009","0009","0009","002f","002f","0020","041f","0440",
"0435","0440","0432","0430","0442","044c","0020","0446","0438","043a","043b","002e","000a","0009","0009","0009",
"0009","0062","0072","0065","0061","006b","003b","000a","0009","0009","0009","0009","007d","000a","000a","0009",
"0009","0009","002f","002f","0020","0412","0020","043a","043e","043d","0446","0435","0020","0062","0075","0066",
"0066","0065","0072","0027","0430","0020","043e","0434","0438","043d","0020","0431","0430","0439","0442","002e",
"000a","0009","0009","0009","0069","0066","0020","0028","0061","0064","0064","0072","0033","0020","003d","003d",
"0020","0062","006c","0020","002d","0020","0031","0029","000a","0009","0009","0009","0009","007b","000a","0009",
"0009","0009","0009","0061","0064","0064","0072","0032","0020","003d","0020","0061","0064","0064","0072","0033",
"003b","0020","0074","006f","0074","0061","006c","0020","003d","0020","0031","003b","000a","000a","0009","0009",
"0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0443","043a",
"0430","0437","0430","0442","0435","043b","044c","0020","043d","0430","0020","043d","0435","043f","043e","0432",
"0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b",
"0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0030","003b","000a","0009",
"0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0430",
"0434","0440","0435","0441","0020","043f","0435","0440","0432","043e","0433","043e","0020","043d","0435","043f",
"043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072","0061","0079",
"0031","005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0061","0064",
"0064","0072","0032","003b","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020","043c","0430",
"0441","0441","0438","0432","0020","0430","0434","0440","0435","0441","0020","043f","043e","0441","043b","0435",
"0434","043d","0435","0433","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e","000a",
"0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064","0072",
"0031","002b","002b","005d","0020","003d","0020","0061","0064","0064","0072","0033","003b","000a","0009","0009",
"0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0441","043a",
"043e","043b","044c","043a","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e","000a",
"0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064","0072",
"0031","005d","0020","003d","0020","0074","006f","0074","0061","006c","003b","000a","000a","0009","0009","0009",
"0009","002f","002f","0020","041f","0440","0435","0440","0432","0430","0442","044c","0020","0446","0438","043a",
"043b","002e","000a","0009","0009","0009","0009","0062","0072","0065","0061","006b","003b","000a","0009","0009",
"0009","0009","007d","000a","000a","0009","0009","0009","002f","002f","0020","041e","0434","0438","043d","0020",
"0440","0430","0437","0020","043c","043e","0436","043d","043e","0020","0432","044b","043f","043e","043b","043d",
"0438","0442","044c","0020","0069","0066","002c","0020","0430","0020","043f","043e","0442","043e","043c","0020",
"0441","0434","0435","043b","0430","0442","044c","0020","0447","0435","0440","0435","0437","0020","0073","0077",
"0069","0074","0063","0068","002e","000a","0009","0009","0009","002f","002f","0020","041d","0430","0434","043e",
"0020","043f","043e","0434","0443","043c","0430","0442","044c","0021","000a","0009","0009","0009","0069","0066",
"0020","0028","0062","0075","0066","0066","0065","0072","005b","0061","0064","0064","0072","0033","005d","0020",
"003d","003d","0020","0062","0075","0066","0066","0065","0072","005b","0061","0064","0064","0072","0033","0020",
"002b","0020","0031","005d","0029","000a","0009","0009","0009","0009","007b","000a","0009","0009","0009","0009",
"002f","002f","0020","041f","043e","0432","0442","043e","0440","044f","044e","0449","0438","0435","0441","044f",
"002e","000a","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020","0061","0064","0064","0072",
"0032","0020","0430","0434","0440","0435","0441","0020","043f","0435","0440","0432","043e","0433","043e","0020",
"043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0064","0064","0072",
"0032","0020","003d","0020","0061","0064","0064","0072","0033","003b","000a","000a","0009","0009","0009","0009",
"002f","002f","0020","0417","0430","043f","043e","043c","043d","0438","0442","044c","0020","0432","0020","0070",
"0031","002e","000a","0009","0009","0009","0009","0070","0031","0020","003d","0020","0062","0075","0066","0066",
"0065","0072","005b","0061","0064","0064","0072","0033","005d","003b","000a","000a","0009","0009","0009","0009",
"0066","006f","0072","0020","0028","0074","006f","0074","0061","006c","0020","003d","0020","0031","003b","003b",
"0029","0020","002f","002f","0020","0411","0435","0441","043a","043e","043d","0435","0447","043d","044b","0439",
"0020","0446","0438","043a","043b","002e","000a","0009","0009","0009","0009","0009","007b","000a","0009","0009",
"0009","0009","0009","002f","002f","0020","0414","043e","0441","0442","0438","0433","043d","0443","0442","0020",
"043a","043e","043d","0435","0446","0020","0062","0075","0066","0066","0065","0072","0027","0430","002e","000a",
"0009","0009","0009","0009","0009","0069","0066","0020","0028","0061","0064","0064","0072","0033","0020","003d",
"003d","0020","0062","006c","0020","002d","0020","0031","0029","000a","0009","0009","0009","0009","0009","0009",
"007b","000a","0009","0009","0009","0009","0009","0009","002f","002f","0020","041f","0440","0435","0440","0432",
"0430","0442","044c","0020","0446","0438","043a","043b","002e","000a","0009","0009","0009","0009","0009","0009",
"0062","0072","0065","0061","006b","003b","000a","0009","0009","0009","0009","0009","0009","007d","000a","000a",
"0009","0009","0009","0009","0009","002f","002f","0020","0415","0441","043b","0438","0020","0438","0434","0443",
"0442","0020","043f","043e","0432","0442","043e","0440","002e","002c","0020","0442","043e","0020","0441","0447",
"0438","0442","0430","0435","043c","0020","0438","0445","002e","000a","0009","0009","0009","0009","0009","0069",
"0066","0020","0028","0070","0031","0020","003d","003d","0020","0062","0075","0066","0066","0065","0072","005b",
"0061","0064","0064","0072","0033","0020","002b","0020","0031","005d","0029","000a","0009","0009","0009","0009",
"0009","0009","007b","000a","0009","0009","0009","0009","0009","0009","0061","0064","0064","0072","0033","002b",
"002b","003b","000a","000a","0009","0009","0009","0009","0009","0009","002f","002f","0020","0412","0020","0074",
"006f","0074","0061","006c","0020","0441","043a","043e","043b","044c","043a","043e","0020","043f","043e","0432",
"0442","043e","0440","002e","000a","0009","0009","0009","0009","0009","0009","0074","006f","0074","0061","006c",
"002b","002b","003b","000a","0009","0009","0009","0009","0009","0009","007d","000a","0009","0009","0009","0009",
"0009","0009","0065","006c","0073","0065","000a","0009","0009","0009","0009","0009","0009","007b","000a","0009",
"0009","0009","0009","0009","0009","002f","002f","0020","041f","0440","0435","0440","0432","0430","0442","044c",
"0020","0446","0438","043a","043b","002e","000a","0009","0009","0009","0009","0009","0009","0062","0072","0065",
"0061","006b","003b","000a","0009","0009","0009","0009","0009","0009","007d","000a","0009","0009","0009","0009",
"0009","007d","000a","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441",
"0441","0438","0432","0020","0443","043a","0430","0437","0430","0442","0435","043b","044c","0020","043d","0430",
"0020","043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072",
"0061","0079","0031","005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020",
"0031","003b","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441",
"0438","0432","0020","0430","0434","0440","0435","0441","0020","043f","0435","0440","0432","043e","0433","043e",
"0020","043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072",
"0061","0079","0031","005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020",
"0061","0064","0064","0072","0032","003b","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020",
"043c","0430","0441","0441","0438","0432","0020","0430","0434","0440","0435","0441","0020","043f","043e","0441",
"043b","0435","0434","043d","0435","0433","043e","0020","043f","043e","0432","0442","043e","0440","002e","000a",
"0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064","0072",
"0031","002b","002b","005d","0020","003d","0020","0061","0064","0064","0072","0033","003b","000a","0009","0009",
"0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0441","043a",
"043e","043b","044c","043a","043e","0020","043f","043e","0432","0442","043e","0440","002e","000a","0009","0009",
"0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064","0072","0031","002b",
"002b","005d","0020","003d","0020","0074","006f","0074","0061","006c","003b","000a","0009","0009","0009","0009",
"007d","000a","0009","0009","0009","0009","0065","006c","0073","0065","000a","0009","0009","0009","0009","007b",
"000a","0009","0009","0009","0009","002f","002f","0020","041d","0435","043f","043e","0432","0442","043e","0440",
"044f","044e","0449","0438","0435","0441","044f","002e","000a","000a","0009","0009","0009","0009","002f","002f",
"0020","0412","0020","0061","0064","0064","0072","0032","0020","0430","0434","0440","0435","0441","0020","043f",
"0435","0440","0432","043e","0433","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e",
"000a","0009","0009","0009","0009","0061","0064","0064","0072","0032","0020","003d","0020","0061","0064","0064",
"0072","0033","003b","000a","000a","0009","0009","0009","0009","0066","006f","0072","0020","0028","0074","006f",
"0074","0061","006c","0020","003d","0020","0031","003b","003b","0029","0020","002f","002f","0020","0411","0435",
"0441","043a","043e","043d","0435","0447","043d","044b","0439","0020","0446","0438","043a","043b","002e","000a",
"0009","0009","0009","0009","0009","007b","000a","0009","0009","0009","0009","0009","002f","002f","0020","0414",
"043e","0441","0442","0438","0433","043d","0443","0442","0020","043a","043e","043d","0435","0446","0020","0062",
"0075","0066","0066","0065","0072","0027","0430","002e","000a","0009","0009","0009","0009","0009","0069","0066",
"0020","0028","0061","0064","0064","0072","0033","0020","003d","003d","0020","0062","006c","0020","002d","0020",
"0031","0029","000a","0009","0009","0009","0009","0009","0009","007b","000a","0009","0009","0009","0009","0009",
"0009","002f","002f","0020","041f","0440","0435","0440","0432","0430","0442","044c","0020","0446","0438","043a",
"043b","002e","000a","0009","0009","0009","0009","0009","0009","0062","0072","0065","0061","006b","003b","000a",
"0009","0009","0009","0009","0009","0009","007d","000a","000a","0009","0009","0009","0009","0009","002f","002f",
"0020","041f","0440","043e","0434","043e","043b","0436","0430","0435","043c","0020","0438","0441","043a","0430",
"0442","044c","0020","043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0009",
"0069","0066","0020","0028","0062","0075","0066","0066","0065","0072","005b","0061","0064","0064","0072","0033",
"005d","0020","003d","003d","0020","0062","0075","0066","0066","0065","0072","005b","0061","0064","0064","0072",
"0033","0020","002b","0020","0031","005d","0029","000a","0009","0009","0009","0009","0009","0009","007b","000a",
"0009","0009","0009","0009","0009","0009","002f","002f","0020","041e","0442","043a","0430","0442","0438","0442",
"0441","044f","0020","043d","0430","0437","0430","0434","0020","0028","043a","0020","043a","043e","043d","0446",
"0443","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e","0029","002e","000a","0009","0009",
"0009","0009","0009","0009","0074","006f","0074","0061","006c","002d","002d","003b","000a","0009","0009","0009",
"0009","0009","0009","0061","0064","0064","0072","0033","002d","002d","003b","000a","000a","0009","0009","0009",
"0009","0009","0009","002f","002f","0020","041f","0440","0435","0440","0432","0430","0442","044c","0020","0446",
"0438","043a","043b","002e","000a","0009","0009","0009","0009","0009","0009","0062","0072","0065","0061","006b",
"003b","000a","0009","0009","0009","0009","0009","0009","007d","000a","0009","0009","0009","0009","0009","0009",
"0065","006c","0073","0065","000a","0009","0009","0009","0009","0009","0009","007b","000a","0009","0009","0009",
"0009","0009","0009","0061","0064","0064","0072","0033","002b","002b","003b","000a","000a","0009","0009","0009",
"0009","0009","0009","002f","002f","0020","0412","0020","0074","006f","0074","0061","006c","0020","0441","043a",
"043e","043b","044c","043a","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e","000a",
"0009","0009","0009","0009","0009","0009","0074","006f","0074","0061","006c","002b","002b","003b","000a","0009",
"0009","0009","0009","0009","0009","007d","000a","0009","0009","0009","0009","0009","007d","000a","000a","0009",
"0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0443",
"043a","0430","0437","0430","0442","0435","043b","044c","0020","043d","0430","0020","043d","0435","043f","043e",
"0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072","0061","0079","0031",
"005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0030","003b","000a",
"0009","0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020",
"0430","0434","0440","0435","0441","0020","043f","0435","0440","0432","043e","0433","043e","0020","043d","0435",
"043f","043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","0009","0061","0072","0072","0061",
"0079","0031","005b","0061","0061","0064","0064","0072","0031","002b","002b","005d","0020","003d","0020","0061",
"0064","0064","0072","0032","003b","000a","0009","0009","0009","0009","002f","002f","0020","0412","0020","043c",
"0430","0441","0441","0438","0432","0020","0430","0434","0440","0435","0441","0020","043f","043e","0441","043b",
"0435","0434","043d","0435","0433","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e",
"000a","0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064",
"0072","0031","002b","002b","005d","0020","003d","0020","0061","0064","0064","0072","0033","003b","000a","0009",
"0009","0009","0009","002f","002f","0020","0412","0020","043c","0430","0441","0441","0438","0432","0020","0441",
"043a","043e","043b","044c","043a","043e","0020","043d","0435","043f","043e","0432","0442","043e","0440","002e",
"000a","0009","0009","0009","0009","0061","0072","0072","0061","0079","0031","005b","0061","0061","0064","0064",
"0072","0031","002b","002b","005d","0020","003d","0020","0074","006f","0074","0061","006c","003b","000a","0009",
"0009","0009","0009","007d","000a","0009","0009","0009","0061","0064","0064","0072","0033","002b","002b","003b",
"000a","0009","0009","0009","007d","000a","0009","0009","007d","000a","000a","0009","0072","0065","0074","0075",
"0072","006e","0020","0061","0072","0072","0061","0079","0031","003b","000a","007d"

];

// 2.
// Функция, которая кодирует (функция с ошибкой).

var ArrayPRG2 =
[

"002f","002f","000a","002f","002f","0020","041a","043e","0434","0438","0440","0443","0435","043c","0020","0434",
"0430","043d","043d","044b","0435","002e","000a","002f","002f","000a","0066","0075","006e","0063","0074","0069",
"006f","006e","0020","0056","0052","004c","0045","0038","0043","006f","0064","0069","006e","0067","0028","0061",
"0072","0072","0061","0079","0031","002c","0020","0061","0072","0072","0061","0079","0032","0029","000a","007b",
"000a","000a","0009","002f","002f","0020","0061","0072","0072","0061","0079","0031","0020","002d","0020","041c",
"0430","0441","0441","0438","0432","0020","0441","0020","0434","0430","043d","043d","044b","043c","0438","0020",
"0028","0447","0438","0441","043b","043e","0432","043e","0439","0020","043c","0430","0441","0441","0438","0432",
"002c","0020","043a","0430","0436","0434","0430","044f","0020","044f","0447","0435","0439","043a","0430","0020",
"043e","0442","0020","0030","0020","0438","0020","0434","043e","0020","0032","0035","0035","002c","0020","0431",
"0430","0439","0442","044b","0029","002e","000a","0009","002f","002f","0020","0020","0020","0020","0020","0020",
"0020","0020","0020","0020","042d","0442","043e","0020","0442","043e","002c","0020","0447","0442","043e","0020",
"043d","0443","0436","043d","043e","0020","0437","0430","043a","043e","0434","0438","0440","043e","0432","0430",
"0442","044c","002e","000a","000a","0009","002f","002f","0020","0061","0072","0072","0061","0079","0032","0020",
"002d","0020","041c","0430","0441","0441","0438","0432","0020","0441","0020","0430","0434","0440","0435","0441",
"0430","043c","0438","0020","043f","043e","0432","0442","043e","0440","002e","002f","043d","0435","043f","043e",
"0432","0442","043e","0440","0020","0028","0447","0438","0441","043b","043e","0432","043e","0439","0020","043c",
"0430","0441","0441","0438","0432","0029","002e","000a","000a","0009","002f","002f","0020","041a","043e","0434",
"0438","0440","0443","0435","043c","0020","0432","0020","0061","0072","0072","0061","0079","0063","006f","0064",
"0069","006e","0067","0038","002e","000a","0009","0076","0061","0072","0020","0061","0072","0072","0061","0079",
"0063","006f","0064","0069","006e","0067","0038","0020","003d","0020","005b","005d","003b","000a","000a","0009",
"0076","0061","0072","0020","0061","0064","0064","0072","0032","002c","0020","0061","0064","0064","0072","0063",
"006f","0064","0069","006e","0067","002c","0020","007a","0031","002c","0020","007a","0032","002c","0020","007a",
"0033","002c","0020","0062","0031","002c","0020","0061","003b","000a","000a","0009","0061","0064","0064","0072",
"0063","006f","0064","0069","006e","0067","0020","003d","0020","0030","003b","000a","000a","0009","0066","006f",
"0072","0020","0028","0061","0064","0064","0072","0032","0020","003d","0020","0030","003b","0020","0061","0064",
"0064","0072","0032","0020","003c","0020","0061","0072","0072","0061","0079","0032","002e","006c","0065","006e",
"0067","0074","0068","003b","0029","000a","0009","0009","007b","000a","0009","0009","002f","002f","0020","041a",
"043e","0434","0438","0440","043e","0432","0430","043d","0438","0435","002e","000a","0009","0009","0073","0077",
"0069","0074","0063","0068","0020","0028","0061","0072","0072","0061","0079","0032","005b","0061","0064","0064",
"0072","0032","005d","0029","000a","0009","0009","0009","007b","000a","000a","0009","0009","0009","002f","002f",
"0020","002d","002d","002d","002d","002d","002d","002d","000a","0009","0009","0009","002f","002f","0020","041f",
"043e","0432","0442","043e","0440","002e","000a","0009","0009","0009","002f","002f","0020","002d","002d","002d",
"002d","002d","002d","002d","000a","000a","0009","0009","0009","0063","0061","0073","0065","0020","0031","003a",
"000a","000a","0009","0009","0009","002f","002f","0020","0411","0430","0439","0442","002c","0020","043a","043e",
"0442","043e","0440","044b","0439","0020","043d","0443","0436","043d","043e","0020","043f","043e","0432","0442",
"043e","0440","0438","0442","044c","002e","000a","0009","0009","0009","0062","0031","0020","003d","0020","0061",
"0072","0072","0061","0079","0031","005b","0061","0072","0072","0061","0079","0032","005b","0061","0064","0064",
"0072","0032","0020","002b","0020","0031","005d","005d","003b","000a","000a","0009","0009","0009","007a","0031",
"0020","003d","0020","0061","0072","0072","0061","0079","0032","005b","0061","0064","0064","0072","0032","0020",
"002b","0020","0031","005d","003b","0020","002f","002f","0020","041d","0430","0447","0430","043b","044c","043d",
"044b","0439","0020","0430","0434","0440","0435","0441","002e","000a","0009","0009","0009","007a","0032","0020",
"003d","0020","0061","0072","0072","0061","0079","0032","005b","0061","0064","0064","0072","0032","0020","002b",
"0020","0032","005d","003b","0020","002f","002f","0020","041a","043e","043d","0435","0447","043d","044b","0439",
"0020","0430","0434","0440","0435","0441","002e","000a","000a","0009","0009","0009","002f","002f","0020","041c",
"0438","043d","0438","043c","0430","043b","044c","043d","0430","044f","0020","043f","043e","0440","0446","0438",
"044f","0020","002d","0020","0032","0020","0431","0430","0439","0442","0430","002e","000a","0009","0009","0009",
"002f","002f","0020","041c","0430","043a","0441","0438","043c","0430","043b","044c","043d","0430","044f","0020",
"043f","043e","0440","0446","0438","044f","0020","002d","0020","0031","0032","0037","0020","0431","0430","0439",
"0442","002e","000a","0020","000a","0009","0009","0009","002f","002f","0020","0412","0020","007a","0033","0020",
"0440","0430","0437","043c","0435","0440","0020","043f","043e","0440","0446","0438","0438","002e","000a","0009",
"0009","0009","007a","0033","0020","003d","0020","0032","003b","000a","000a","0009","0009","0009","007a","0031",
"002b","002b","003b","000a","0009","0009","0009","007a","0031","002b","002b","003b","000a","000a","0009","0009",
"0009","0066","006f","0072","0020","0028","007a","0031","0020","003d","0020","007a","0031","003b","0020","007a",
"0031","0020","003c","0020","007a","0032","0020","002b","0020","0031","003b","0029","000a","0009","0009","0009",
"0009","007b","000a","000a","0009","0009","0009","0009","002f","002f","0020","0415","0441","043b","0438","0020",
"0031","0032","0037","002c","0020","0437","043d","0430","0447","0438","0442","0020","043c","0430","043a","0441",
"0438","043c","0430","043b","044c","043d","0430","044f","0020","043f","043e","0440","0446","0438","044f","002e",
"000a","0009","0009","0009","0009","0069","0066","0020","0028","007a","0033","0020","003d","003d","0020","0031",
"0032","0037","0029","000a","0009","0009","0009","0009","0009","007b","000a","0009","0009","0009","0009","0009",
"002f","002f","0020","0020","0020","0020","041b","043e","0433","0438","0447","0435","0441","043a","043e","0435",
"0020","0418","041b","0418","0020","0028","007c","0029","003a","000a","0009","0009","0009","0009","0009","002f",
"002f","0020","0020","0020","0020","0020","0020","0020","0030","0020","0030","0020","007c","0020","0030","000a",
"0009","0009","0009","0009","0009","002f","002f","0020","0020","0020","0020","0020","0020","0020","0030","0020",
"0031","0020","007c","0020","0031","000a","0009","0009","0009","0009","0009","002f","002f","0020","0020","0020",
"0020","0020","0020","0020","0031","0020","0030","0020","007c","0020","0031","000a","0009","0009","0009","0009",
"0009","002f","002f","0020","0020","0020","0020","0020","0020","0020","0031","0020","0031","0020","007c","0020",
"0031","000a","000a","0009","0009","0009","0009","0009","002f","002f","0020","0417","0430","043f","0438","0441",
"044b","0432","0430","0435","043c","0020","0438","043d","0444","043e","0440","043c","0430","0446","0438","043e",
"043d","043d","044b","0439","0020","0431","0430","0439","0442","002e","000a","0009","0009","0009","0009","0009",
"002f","002f","0020","0423","0441","0442","0430","043d","043e","0432","0438","0442","044c","0020","0037","002d",
"0439","0020","0431","0438","0442","0020","0432","0020","0031","002c","0020","043e","0441","0442","0430","043b",
"044c","043d","044b","0435","0020","0431","0438","0442","044b","0020","043e","0441","0442","0430","0432","0438",
"0442","044c","0020","0431","0435","0437","0020","0438","0437","043c","0435","043d","0435","043d","0438","0439",
"002e","000a","0009","0009","0009","0009","0009","0061","0072","0072","0061","0079","0063","006f","0064","0069",
"006e","0067","0038","005b","0061","0064","0064","0072","0063","006f","0064","0069","006e","0067","002b","002b",
"005d","0020","003d","0020","0031","0032","0038","0020","007c","0020","007a","0033","003b","000a","000a","0009",
"0009","0009","0009","0009","002f","002f","0020","0417","0430","043f","0438","0441","044b","0432","0430","0435",
"043c","0020","0431","0430","0439","0442","002c","0020","043a","043e","0442","043e","0440","044b","0439","0020",
"043d","0443","0436","043d","043e","0020","043f","043e","0432","0442","043e","0440","0438","0442","044c","002e",
"000a","0009","0009","0009","0009","0009","0061","0072","0072","0061","0079","0063","006f","0064","0069","006e",
"0067","0038","005b","0061","0064","0064","0072","0063","006f","0064","0069","006e","0067","002b","002b","005d",
"0020","003d","0020","0062","0031","003b","000a","000a","0009","0009","0009","0009","0009","007a","0033","0020",
"003d","0020","0031","003b","000a","0009","0009","0009","0009","0009","007a","0031","002b","002b","003b","000a",
"0009","0009","0009","0009","0009","007d","000a","000a","0009","0009","0009","0009","007a","0033","002b","002b",
"003b","000a","0009","0009","0009","0009","007a","0031","002b","002b","003b","000a","0009","0009","0009","0009",
"007d","000a","000a","0009","0009","0009","002f","002f","0020","0417","0430","043f","0438","0441","044b","0432",
"0430","0435","043c","0020","0438","043d","0444","043e","0440","043c","0430","0446","0438","043e","043d","043d",
"044b","0439","0020","0431","0430","0439","0442","002e","000a","0009","0009","0009","002f","002f","0020","0423",
"0441","0442","0430","043d","043e","0432","0438","0442","044c","0020","0037","002d","0439","0020","0431","0438",
"0442","0020","0432","0020","0031","002c","0020","043e","0441","0442","0430","043b","044c","043d","044b","0435",
"0020","0431","0438","0442","044b","0020","043e","0441","0442","0430","0432","0438","0442","044c","0020","0431",
"0435","0437","0020","0438","0437","043c","0435","043d","0435","043d","0438","0439","002e","000a","0009","0009",
"0009","0061","0072","0072","0061","0079","0063","006f","0064","0069","006e","0067","0038","005b","0061","0064",
"0064","0072","0063","006f","0064","0069","006e","0067","002b","002b","005d","0020","003d","0020","0031","0032",
"0038","0020","007c","0020","007a","0033","003b","000a","000a","0009","0009","0009","002f","002f","0020","0417",
"0430","043f","0438","0441","044b","0432","0430","0435","043c","0020","0431","0430","0439","0442","002c","0020",
"043a","043e","0442","043e","0440","044b","0439","0020","043d","0443","0436","043d","043e","0020","043f","043e",
"0432","0442","043e","0440","0438","0442","044c","002e","000a","0009","0009","0009","0061","0072","0072","0061",
"0079","0063","006f","0064","0069","006e","0067","0038","005b","0061","0064","0064","0072","0063","006f","0064",
"0069","006e","0067","002b","002b","005d","0020","003d","0020","0062","0031","003b","000a","000a","0009","0009",
"0009","002f","002f","0020","041f","0440","0435","0440","0432","0430","0442","044c","0020","0073","0077","0069",
"0074","0063","0068","002e","000a","0009","0009","0009","0062","0072","0065","0061","006b","003b","000a","000a",
"0009","0009","0009","002f","002f","0020","002d","002d","002d","002d","002d","002d","002d","002d","002d","000a",
"0009","0009","0009","002f","002f","0020","041d","0435","043f","043e","0432","0442","043e","0440","002e","000a",
"0009","0009","0009","002f","002f","0020","002d","002d","002d","002d","002d","002d","002d","002d","002d","000a",
"000a","0009","0009","0009","0063","0061","0073","0065","0020","0030","003a","000a","000a","0009","0009","0009",
"002f","002f","0020","0417","0430","043f","043e","043c","0438","043d","0430","0435","043c","0020","0430","0434",
"0440","0435","0441","002e","000a","0009","0009","0009","0061","0020","003d","0020","0061","0064","0064","0072",
"0063","006f","0064","0069","006e","0067","003b","000a","000a","0009","0009","0009","002f","002f","0020","041f",
"0440","043e","043f","0443","0441","043a","0020","0028","043e","0441","0442","0430","0432","043b","044f","0435",
"043c","0020","043c","0435","0441","0442","043e","0020","0434","043b","044f","0020","0438","043d","0444","043e",
"0440","043c","0430","0446","0438","043e","043d","043d","043e","0433","043e","0020","0431","0430","0439","0442",
"0430","0029","002e","000a","0009","0009","0009","0061","0064","0064","0072","0063","006f","0064","0069","006e",
"0067","002b","002b","003b","000a","000a","0009","0009","0009","007a","0031","0020","003d","0020","0061","0072",
"0072","0061","0079","0032","005b","0061","0064","0064","0072","0032","0020","002b","0020","0031","005d","003b",
"0020","002f","002f","0020","041d","0430","0447","0430","043b","044c","043d","044b","0439","0020","0430","0434",
"0440","0435","0441","002e","000a","0009","0009","0009","007a","0032","0020","003d","0020","0061","0072","0072",
"0061","0079","0032","005b","0061","0064","0064","0072","0032","0020","002b","0020","0032","005d","003b","0020",
"002f","002f","0020","041a","043e","043d","0435","0447","043d","044b","0439","0020","0430","0434","0440","0435",
"0441","002e","000a","000a","0009","0009","0009","002f","002f","0020","041c","0438","043d","0438","043c","0430",
"043b","044c","043d","0430","044f","0020","043f","043e","0440","0446","0438","044f","0020","002d","0020","0031",
"0020","0431","0430","0439","0442","002e","000a","0009","0009","0009","002f","002f","0020","041c","0430","043a",
"0441","0438","043c","0430","043b","044c","043d","0430","044f","0020","043f","043e","0440","0446","0438","044f",
"0020","002d","0020","0031","0032","0037","0020","0431","0430","0439","0442","002e","000a","0020","000a","0009",
"0009","0009","002f","002f","0020","0412","0020","007a","0033","0020","0440","0430","0437","043c","0435","0440",
"0020","043f","043e","0440","0446","0438","0438","002e","000a","0009","0009","0009","007a","0033","0020","003d",
"0020","0030","003b","000a","000a","0009","0009","0009","0066","006f","0072","0020","0028","007a","0031","0020",
"003d","0020","007a","0031","003b","0020","007a","0031","0020","003c","0020","007a","0032","0020","002b","0020",
"0031","003b","0029","000a","0009","0009","0009","0009","007b","000a","000a","0009","0009","0009","0009","002f",
"002f","0020","0415","0441","043b","0438","0020","0031","0032","0037","002c","0020","0437","043d","0430","0447",
"0438","0442","0020","043c","0430","043a","0441","0438","043c","0430","043b","044c","043d","0430","044f","0020",
"043f","043e","0440","0446","0438","044f","002e","000a","0009","0009","0009","0009","0069","0066","0020","0028",
"007a","0033","0020","003d","003d","0020","0031","0032","0037","0029","000a","0009","0009","0009","0009","0009",
"007b","000a","0009","0009","0009","0009","0009","002f","002f","0020","0417","0430","043f","0438","0441","044b",
"0432","0430","0435","043c","0020","0438","043d","0444","043e","0440","043c","0430","0446","0438","043e","043d",
"043d","044b","0439","0020","0431","0430","0439","0442","002e","000a","0009","0009","0009","0009","0009","002f",
"002f","0020","0037","002d","0439","0020","0431","0438","0442","0020","0443","0436","0435","0020","0432","0020",
"0030","0021","000a","0009","0009","0009","0009","0009","0061","0072","0072","0061","0079","0063","006f","0064",
"0069","006e","0067","0038","005b","0061","005d","0020","003d","0020","007a","0033","003b","000a","000a","0009",
"0009","0009","0009","0009","002f","002f","0020","0417","0430","043f","043e","043c","0438","043d","0430","0435",
"043c","0020","0430","0434","0440","0435","0441","002e","000a","0009","0009","0009","0009","0009","0061","0020",
"003d","0020","0061","0064","0064","0072","0063","006f","0064","0069","006e","0067","003b","000a","000a","0009",
"0009","0009","0009","0009","002f","002f","0020","041f","0440","043e","043f","0443","0441","043a","0020","0028",
"043e","0441","0442","0430","0432","043b","044f","0435","043c","0020","043c","0435","0441","0442","043e","0020",
"0434","043b","044f","0020","0438","043d","0444","043e","0440","043c","0430","0446","0438","043e","043d","043d",
"043e","0433","043e","0020","0431","0430","0439","0442","0430","0029","002e","000a","0009","0009","0009","0009",
"0009","0061","0064","0064","0072","0063","006f","0064","0069","006e","0067","002b","002b","000a","000a","0009",
"0009","0009","0009","0009","007a","0033","0020","003d","0020","0030","003b","000a","0009","0009","0009","0009",
"0009","007d","000a","000a","0009","0009","0009","0009","002f","002f","0020","041f","0435","0440","0435","043f",
"0438","0441","044b","0432","0430","0435","043c","0020","043d","0435","043f","043e","0432","0442","043e","0440",
"002e","0020","0431","0430","0439","0442","0028","044b","0029","002e","000a","0009","0009","0009","0009","0061",
"0072","0072","0061","0079","0063","006f","0064","0069","006e","0067","0038","005b","0061","0064","0064","0072",
"0063","006f","0064","0069","006e","0067","002b","002b","005d","0020","003d","0020","0061","0072","0072","0061",
"0079","0031","005b","007a","0031","005d","003b","000a","000a","0009","0009","0009","0009","007a","0033","002b",
"002b","003b","000a","0009","0009","0009","0009","007a","0031","002b","002b","003b","000a","0009","0009","0009",
"0009","007d","000a","000a","0009","0009","0009","002f","002f","0020","0417","0430","043f","0438","0441","044b",
"0432","0430","0435","043c","0020","0438","043d","0444","043e","0440","043c","0430","0446","0438","043e","043d",
"043d","044b","0439","0020","0431","0430","0439","0442","002e","000a","0009","0009","0009","002f","002f","0020",
"0037","002d","0439","0020","0431","0438","0442","0020","0443","0436","0435","0020","0432","0020","0030","0021",
"000a","0009","0009","0009","0061","0072","0072","0061","0079","0063","006f","0064","0069","006e","0067","0038",
"005b","0061","005d","0020","003d","0020","007a","0033","003b","000a","000a","0009","0009","0009","002f","002f",
"0020","041f","0440","0435","0440","0432","0430","0442","044c","0020","0073","0077","0069","0074","0063","0068",
"002e","000a","0009","0009","0009","0062","0072","0065","0061","006b","003b","000a","0009","0009","0009","007d",
"000a","0009","0009","0061","0064","0064","0072","0032","0020","003d","0020","0061","0064","0064","0072","0032",
"0020","002b","0020","0034","003b","000a","0009","0009","007d","000a","000a","0009","002f","002f","0020","0412",
"0435","0440","043d","0443","0442","044c","0020","0437","0430","043a","043e","0434","0438","0440","043e","0432",
"0430","043d","043d","044b","0439","0020","043c","0430","0441","0441","0438","0432","002e","000a","0009","0072",
"0065","0074","0075","0072","006e","0020","0061","0072","0072","0061","0079","0063","006f","0064","0069","006e",
"0067","0038","003b","000a","007d","000a"

];

// 2.
// Функция, которая кодирует (исправленный вариант).

var ArrayPRG3 =
[

"2f","2f","0a","2f","2f","20","8a","ae","a4","a8","e0","e3","a5","ac","20","a4",
"a0","ad","ad","eb","a5","2e","0a","2f","2f","20","88","e1","af","e0","a0","a2",
"ab","a5","ad","ad","eb","a9","20","a2","a0","e0","a8","a0","ad","e2","2e","0a",
"2f","2f","0a","66","75","6e","63","74","69","6f","6e","20","56","52","4c","45",
"38","43","6f","64","69","6e","67","28","61","72","72","61","79","31","2c","20",
"61","72","72","61","79","32","29","0a","7b","0a","0a","09","2f","2f","20","61",
"72","72","61","79","31","20","2d","20","8c","a0","e1","e1","a8","a2","20","e1",
"20","a4","a0","ad","ad","eb","ac","a8","20","28","e7","a8","e1","ab","ae","a2",
"ae","a9","20","ac","a0","e1","e1","a8","a2","2c","20","aa","a0","a6","a4","a0",
"ef","20","ef","e7","a5","a9","aa","a0","20","ae","e2","20","30","20","a8","20",
"a4","ae","20","32","35","35","2c","20","a1","a0","a9","e2","eb","29","2e","0a",
"09","2f","2f","20","20","20","20","20","20","20","20","20","20","9d","e2","ae",
"20","e2","ae","2c","20","e7","e2","ae","20","ad","e3","a6","ad","ae","20","a7",
"a0","aa","ae","a4","a8","e0","ae","a2","a0","e2","ec","2e","0a","0a","09","2f",
"2f","20","61","72","72","61","79","32","20","2d","20","8c","a0","e1","e1","a8",
"a2","20","e1","20","a0","a4","e0","a5","e1","a0","ac","a8","20","af","ae","a2",
"e2","ae","e0","2e","2f","ad","a5","af","ae","a2","e2","ae","e0","20","28","e7",
"a8","e1","ab","ae","a2","ae","a9","20","ac","a0","e1","e1","a8","a2","29","2e",
"0a","0a","09","2f","2f","20","8a","ae","a4","a8","e0","e3","a5","ac","20","a2",
"20","61","72","72","61","79","63","6f","64","69","6e","67","38","2e","0a","09",
"76","61","72","20","61","72","72","61","79","63","6f","64","69","6e","67","38",
"20","3d","20","5b","5d","3b","0a","0a","09","76","61","72","20","61","64","64",
"72","32","2c","20","61","64","64","72","63","6f","64","69","6e","67","2c","20",
"7a","31","2c","20","7a","32","2c","20","7a","33","2c","20","62","31","3b","0a",
"09","76","61","72","20","74","70","6f","72","31","2c","20","74","70","6f","72",
"32","2c","20","73","77","70","6f","72","2c","20","74","31","2c","20","74","32",
"2c","20","7a","34","3b","0a","0a","09","61","64","64","72","63","6f","64","69",
"6e","67","20","3d","20","30","3b","0a","0a","09","66","6f","72","20","28","61",
"64","64","72","32","20","3d","20","30","3b","20","61","64","64","72","32","20",
"3c","20","61","72","72","61","79","32","2e","6c","65","6e","67","74","68","3b",
"29","0a","09","09","7b","0a","09","09","2f","2f","20","8a","ae","a4","a8","e0",
"ae","a2","a0","ad","a8","a5","2e","0a","09","09","73","77","69","74","63","68",
"20","28","61","72","72","61","79","32","5b","61","64","64","72","32","5d","29",
"0a","09","09","09","7b","0a","0a","09","09","09","2f","2f","20","2d","2d","2d",
"2d","2d","2d","2d","0a","09","09","09","2f","2f","20","8f","ae","a2","e2","ae",
"e0","2e","0a","09","09","09","2f","2f","20","2d","2d","2d","2d","2d","2d","2d",
"0a","0a","09","09","09","2f","2f","20","8c","a8","ad","a8","ac","a0","ab","ec",
"ad","a0","ef","20","af","ae","e0","e6","a8","ef","20","2d","20","32","20","a1",
"a0","a9","e2","a0","2e","0a","09","09","09","2f","2f","20","8c","a0","aa","e1",
"a8","ac","a0","ab","ec","ad","a0","ef","20","af","ae","e0","e6","a8","ef","20",
"2d","20","31","32","37","20","a1","a0","a9","e2","2e","0a","0a","09","09","09",
"63","61","73","65","20","31","3a","0a","0a","09","09","09","2f","2f","20","81",
"a0","a9","e2","2c","20","aa","ae","e2","ae","e0","eb","a9","20","ad","e3","a6",
"ad","ae","20","af","ae","a2","e2","ae","e0","a8","e2","ec","2e","0a","09","09",
"09","62","31","20","3d","20","61","72","72","61","79","31","5b","61","72","72",
"61","79","32","5b","61","64","64","72","32","20","2b","20","31","5d","5d","3b",
"0a","0a","09","09","09","74","70","6f","72","31","20","3d","20","61","72","72",
"61","79","32","5b","61","64","64","72","32","20","2b","20","33","5d","3b","20",
"2f","2f","20","91","aa","ae","ab","ec","aa","ae","20","af","ae","a2","e2","ae",
"e0","2e","0a","0a","09","09","09","69","66","20","28","74","70","6f","72","31",
"20","3c","20","31","32","37","29","0a","09","09","09","09","7b","0a","09","09",
"09","09","2f","2f","20","92","ae","ab","ec","aa","ae","20","e7","a0","e1","e2",
"ec","20","af","ae","e0","e6","a8","a8","2e","0a","09","09","09","09","2f","2f",
"20","82","20","74","70","6f","72","31","20","2d","20","e1","aa","ae","ab","ec",
"aa","ae","20","af","ae","a2","e2","ae","e0","2e","0a","09","09","09","09","73",
"77","70","6f","72","20","3d","20","31","3b","0a","09","09","09","09","7d","0a",
"09","09","09","09","65","6c","73","65","0a","09","09","09","09","7b","0a","09",
"09","09","09","74","31","20","3d","20","30","3b","0a","0a","09","09","09","09",
"66","6f","72","28","3b","3b","29","0a","09","09","09","09","09","7b","0a","09",
"09","09","09","09","74","70","6f","72","31","20","3d","20","74","70","6f","72",
"31","20","2d","20","31","32","37","3b","0a","09","09","09","09","09","74","31",
"2b","2b","3b","0a","0a","09","09","09","09","09","69","66","20","28","74","70",
"6f","72","31","20","3d","3d","20","30","29","0a","09","09","09","09","09","09",
"7b","0a","09","09","09","09","09","09","2f","2f","20","6e","2d","af","ae","ab",
"ad","eb","e5","20","af","ae","e0","e6","a8","a9","20","a8","20","ad","a5","e2",
"20","ad","a5","af","ae","ab","ad","ae","a9","20","af","ae","e0","e6","a8","a8",
"2e","0a","09","09","09","09","09","09","2f","2f","20","82","20","74","31","20",
"2d","20","e1","aa","ae","ab","ec","aa","ae","20","af","ae","ab","ad","eb","e5",
"20","af","ae","e0","e6","a8","a9","2e","0a","09","09","09","09","09","09","73",
"77","70","6f","72","20","3d","20","32","3b","0a","09","09","09","09","09","09",
"62","72","65","61","6b","3b","0a","09","09","09","09","09","09","7d","0a","0a",
"09","09","09","09","09","69","66","20","28","74","70","6f","72","31","20","3c",
"20","31","32","37","29","0a","09","09","09","09","09","09","7b","0a","09","09",
"09","09","09","09","2f","2f","20","6e","2d","af","ae","ab","ad","eb","e5","20",
"af","ae","e0","e6","a8","a9","20","a8","20","e7","a0","e1","e2","ec","20","af",
"ae","e0","e6","a8","a8","2e","0a","09","09","09","09","09","09","2f","2f","20",
"82","20","74","31","20","2d","20","e1","aa","ae","ab","ec","aa","ae","20","af",
"ae","ab","ad","eb","e5","20","af","ae","e0","e6","a8","a9","2e","0a","09","09",
"09","09","09","09","2f","2f","20","82","20","74","70","6f","72","31","20","2d",
"20","e7","a0","e1","e2","ec","20","af","ae","e0","e6","a8","a8","20","28","e1",
"aa","ae","ab","ec","aa","ae","20","af","ae","a2","e2","ae","e0","2e","29","2e",
"0a","09","09","09","09","09","09","73","77","70","6f","72","20","3d","20","33",
"3b","0a","09","09","09","09","09","09","62","72","65","61","6b","3b","0a","09",
"09","09","09","09","09","7d","0a","09","09","09","09","09","7d","0a","09","09",
"09","09","7d","0a","0a","09","09","09","73","77","69","74","63","68","20","28",
"73","77","70","6f","72","29","0a","09","09","09","09","7b","0a","09","09","09",
"09","63","61","73","65","20","31","3a","0a","0a","09","09","09","09","2f","2f",
"20","8b","ae","a3","a8","e7","a5","e1","aa","ae","a5","20","88","8b","88","20",
"28","7c","29","3a","0a","09","09","09","09","2f","2f","20","20","20","20","30",
"20","30","20","7c","20","30","0a","09","09","09","09","2f","2f","20","20","20",
"20","30","20","31","20","7c","20","31","0a","09","09","09","09","2f","2f","20",
"20","20","20","31","20","30","20","7c","20","31","0a","09","09","09","09","2f",
"2f","20","20","20","20","31","20","31","20","7c","20","31","0a","0a","09","09",
"09","09","2f","2f","20","92","ae","ab","ec","aa","ae","20","e7","a0","e1","e2",
"ec","20","af","ae","e0","e6","a8","a8","2e","0a","0a","09","09","09","09","2f",
"2f","20","87","a0","af","a8","e1","eb","a2","a0","a5","ac","20","a8","ad","e4",
"ae","e0","ac","a0","e6","a8","ae","ad","ad","eb","a9","20","a1","a0","a9","e2",
"2e","0a","09","09","09","09","2f","2f","20","93","e1","e2","a0","ad","ae","a2",
"a8","e2","ec","20","37","2d","a9","20","a1","a8","e2","20","a2","20","31","2c",
"20","ae","e1","e2","a0","ab","ec","ad","eb","a5","20","a1","a8","e2","eb","20",
"ae","e1","e2","a0","a2","a8","e2","ec","20","a1","a5","a7","20","a8","a7","ac",
"a5","ad","a5","ad","a8","a9","2e","0a","09","09","09","09","61","72","72","61",
"79","63","6f","64","69","6e","67","38","5b","61","64","64","72","63","6f","64",
"69","6e","67","2b","2b","5d","20","3d","20","31","32","38","20","7c","20","74",
"70","6f","72","31","3b","0a","0a","09","09","09","09","2f","2f","20","87","a0",
"af","a8","e1","eb","a2","a0","a5","ac","20","a1","a0","a9","e2","2c","20","aa",
"ae","e2","ae","e0","eb","a9","20","ad","e3","a6","ad","ae","20","af","ae","a2",
"e2","ae","e0","a8","e2","ec","2e","0a","09","09","09","09","61","72","72","61",
"79","63","6f","64","69","6e","67","38","5b","61","64","64","72","63","6f","64",
"69","6e","67","2b","2b","5d","20","3d","20","62","31","3b","0a","0a","09","09",
"09","09","62","72","65","61","6b","3b","0a","0a","09","09","09","09","63","61",
"73","65","20","32","3a","0a","0a","09","09","09","09","2f","2f","20","92","ae",
"ab","ec","aa","ae","20","af","ae","ab","ad","a0","ef","20","af","ae","e0","e6",
"a8","ef","20","28","af","ae","ab","ad","eb","a5","20","af","ae","e0","e6","a8",
"a8","29","2e","0a","09","09","09","09","66","6f","72","20","28","7a","31","20",
"3d","20","30","3b","20","7a","31","20","3c","20","74","31","3b","29","0a","09",
"09","09","09","09","7b","0a","09","09","09","09","09","2f","2f","20","87","a0",
"af","a8","e1","eb","a2","a0","a5","ac","20","a8","ad","e4","ae","e0","ac","a0",
"e6","a8","ae","ad","ad","eb","a9","20","a1","a0","a9","e2","2e","0a","09","09",
"09","09","09","2f","2f","20","37","2d","a9","20","a1","a8","e2","20","a2","20",
"31","20","28","37","46","20","3d","3e","20","46","46","29","21","0a","09","09",
"09","09","09","61","72","72","61","79","63","6f","64","69","6e","67","38","5b",
"61","64","64","72","63","6f","64","69","6e","67","2b","2b","5d","20","3d","20",
"32","35","35","3b","0a","0a","09","09","09","09","09","2f","2f","20","87","a0",
"af","a8","e1","eb","a2","a0","a5","ac","20","a1","a0","a9","e2","2c","20","aa",
"ae","e2","ae","e0","eb","a9","20","ad","e3","a6","ad","ae","20","af","ae","a2",
"e2","ae","e0","a8","e2","ec","2e","0a","09","09","09","09","09","61","72","72",
"61","79","63","6f","64","69","6e","67","38","5b","61","64","64","72","63","6f",
"64","69","6e","67","2b","2b","5d","20","3d","20","62","31","3b","0a","0a","09",
"09","09","09","09","7a","31","2b","2b","3b","0a","09","09","09","09","09","7d",
"0a","0a","09","09","09","09","62","72","65","61","6b","3b","0a","0a","09","09",
"09","09","63","61","73","65","20","33","3a","0a","0a","09","09","09","09","2f",
"2f","20","8f","ae","ab","ad","a0","ef","20","af","ae","e0","e6","a8","ef","20",
"28","af","ae","ab","ad","eb","a5","20","af","ae","e0","e6","a8","a8","29","2e",
"0a","09","09","09","09","66","6f","72","20","28","7a","31","20","3d","20","30",
"3b","20","7a","31","20","3c","20","74","31","3b","29","0a","09","09","09","09",
"09","7b","0a","09","09","09","09","09","2f","2f","20","87","a0","af","a8","e1",
"eb","a2","a0","a5","ac","20","a8","ad","e4","ae","e0","ac","a0","e6","a8","ae",
"ad","ad","eb","a9","20","a1","a0","a9","e2","2e","0a","09","09","09","09","09",
"2f","2f","20","37","2d","a9","20","a1","a8","e2","20","a2","20","31","20","28",
"37","46","20","3d","3e","20","46","46","29","21","0a","09","09","09","09","09",
"61","72","72","61","79","63","6f","64","69","6e","67","38","5b","61","64","64",
"72","63","6f","64","69","6e","67","2b","2b","5d","20","3d","20","32","35","35",
"3b","0a","0a","09","09","09","09","09","2f","2f","20","87","a0","af","a8","e1",
"eb","a2","a0","a5","ac","20","a1","a0","a9","e2","2c","20","aa","ae","e2","ae",
"e0","eb","a9","20","ad","e3","a6","ad","ae","20","af","ae","a2","e2","ae","e0",
"a8","e2","ec","2e","0a","09","09","09","09","09","61","72","72","61","79","63",
"6f","64","69","6e","67","38","5b","61","64","64","72","63","6f","64","69","6e",
"67","2b","2b","5d","20","3d","20","62","31","3b","0a","0a","09","09","09","09",
"09","7a","31","2b","2b","3b","0a","09","09","09","09","09","7d","0a","0a","09",
"09","09","09","2f","2f","20","97","a0","e1","e2","ec","20","af","ae","e0","e6",
"a8","a8","20","28","ae","e1","e2","a0","e2","ae","aa","29","2e","0a","0a","09",
"09","09","09","2f","2f","20","87","a0","af","a8","e1","eb","a2","a0","a5","ac",
"20","a8","ad","e4","ae","e0","ac","a0","e6","a8","ae","ad","ad","eb","a9","20",
"a1","a0","a9","e2","2e","0a","09","09","09","09","2f","2f","20","93","e1","e2",
"a0","ad","ae","a2","a8","e2","ec","20","37","2d","a9","20","a1","a8","e2","20",
"a2","20","31","2c","20","ae","e1","e2","a0","ab","ec","ad","eb","a5","20","a1",
"a8","e2","eb","20","ae","e1","e2","a0","a2","a8","e2","ec","20","a1","a5","a7",
"20","a8","a7","ac","a5","ad","a5","ad","a8","a9","2e","0a","09","09","09","09",
"61","72","72","61","79","63","6f","64","69","6e","67","38","5b","61","64","64",
"72","63","6f","64","69","6e","67","2b","2b","5d","20","3d","20","31","32","38",
"20","7c","20","74","70","6f","72","31","3b","0a","0a","09","09","09","09","2f",
"2f","20","87","a0","af","a8","e1","eb","a2","a0","a5","ac","20","a1","a0","a9",
"e2","2c","20","aa","ae","e2","ae","e0","eb","a9","20","ad","e3","a6","ad","ae",
"20","af","ae","a2","e2","ae","e0","a8","e2","ec","2e","0a","09","09","09","09",
"61","72","72","61","79","63","6f","64","69","6e","67","38","5b","61","64","64",
"72","63","6f","64","69","6e","67","2b","2b","5d","20","3d","20","62","31","3b",
"0a","0a","09","09","09","09","62","72","65","61","6b","3b","0a","09","09","09",
"09","7d","0a","0a","09","09","09","62","72","65","61","6b","3b","0a","0a","09",
"09","09","2f","2f","20","2d","2d","2d","2d","2d","2d","2d","2d","2d","0a","09",
"09","09","2f","2f","20","8d","a5","af","ae","a2","e2","ae","e0","2e","0a","09",
"09","09","2f","2f","20","2d","2d","2d","2d","2d","2d","2d","2d","2d","0a","0a",
"09","09","09","2f","2f","20","8c","a8","ad","a8","ac","a0","ab","ec","ad","a0",
"ef","20","af","ae","e0","e6","a8","ef","20","2d","20","31","20","a1","a0","a9",
"e2","2e","0a","09","09","09","2f","2f","20","8c","a0","aa","e1","a8","ac","a0",
"ab","ec","ad","a0","ef","20","af","ae","e0","e6","a8","ef","20","2d","20","31",
"32","37","20","a1","a0","a9","e2","2e","0a","0a","09","09","09","63","61","73",
"65","20","30","3a","0a","0a","09","09","09","2f","2f","20","8d","a0","e7","a0",
"ab","ec","ad","eb","a9","20","a0","a4","e0","a5","e1","20","ad","a5","af","ae",
"a2","e2","ae","e0","2e","0a","09","09","09","7a","33","20","3d","20","61","72",
"72","61","79","32","5b","61","64","64","72","32","20","2b","20","31","5d","3b",
"0a","0a","09","09","09","74","70","6f","72","32","20","3d","20","61","72","72",
"61","79","32","5b","61","64","64","72","32","20","2b","20","33","5d","3b","20",
"2f","2f","20","91","aa","ae","ab","ec","aa","ae","20","ad","a5","af","ae","a2",
"e2","ae","e0","2e","0a","0a","09","09","09","69","66","20","28","74","70","6f",
"72","32","20","3c","20","31","32","37","29","0a","09","09","09","09","7b","0a",
"09","09","09","09","2f","2f","20","92","ae","ab","ec","aa","ae","20","e7","a0",
"e1","e2","ec","20","af","ae","e0","e6","a8","a8","2e","0a","09","09","09","09",
"2f","2f","20","82","20","74","70","6f","72","32","20","2d","20","e1","aa","ae",
"ab","ec","aa","ae","20","ad","a5","af","ae","a2","e2","ae","e0","2e","0a","09",
"09","09","09","73","77","70","6f","72","20","3d","20","31","3b","0a","09","09",
"09","09","7d","0a","09","09","09","09","65","6c","73","65","0a","09","09","09",
"09","7b","0a","09","09","09","09","74","32","20","3d","20","30","3b","0a","0a",
"09","09","09","09","66","6f","72","28","3b","3b","29","0a","09","09","09","09",
"09","7b","0a","09","09","09","09","09","74","70","6f","72","32","20","3d","20",
"74","70","6f","72","32","20","2d","20","31","32","37","3b","0a","09","09","09",
"09","09","74","32","2b","2b","3b","0a","0a","09","09","09","09","09","69","66",
"20","28","74","70","6f","72","32","20","3d","3d","20","30","29","0a","09","09",
"09","09","09","09","7b","0a","09","09","09","09","09","09","2f","2f","20","6e",
"2d","af","ae","ab","ad","eb","e5","20","af","ae","e0","e6","a8","a9","20","a8",
"20","ad","a5","e2","20","ad","a5","af","ae","ab","ad","ae","a9","20","af","ae",
"e0","e6","a8","a8","2e","0a","09","09","09","09","09","09","2f","2f","20","82",
"20","74","32","20","2d","20","e1","aa","ae","ab","ec","aa","ae","20","af","ae",
"ab","ad","eb","e5","20","af","ae","e0","e6","a8","a9","2e","0a","09","09","09",
"09","09","09","73","77","70","6f","72","20","3d","20","32","3b","0a","09","09",
"09","09","09","09","62","72","65","61","6b","3b","0a","09","09","09","09","09",
"09","7d","0a","0a","09","09","09","09","09","69","66","20","28","74","70","6f",
"72","32","20","3c","20","31","32","37","29","0a","09","09","09","09","09","09",
"7b","0a","09","09","09","09","09","09","2f","2f","20","6e","2d","af","ae","ab",
"ad","eb","e5","20","af","ae","e0","e6","a8","a9","20","a8","20","e7","a0","e1",
"e2","ec","20","af","ae","e0","e6","a8","a8","2e","0a","09","09","09","09","09",
"09","2f","2f","20","82","20","74","32","20","2d","20","e1","aa","ae","ab","ec",
"aa","ae","20","af","ae","ab","ad","eb","e5","20","af","ae","e0","e6","a8","a9",
"2e","0a","09","09","09","09","09","09","2f","2f","20","82","20","74","70","6f",
"72","32","20","2d","20","e7","a0","e1","e2","ec","20","af","ae","e0","e6","a8",
"a8","20","28","e1","aa","ae","ab","ec","aa","ae","20","ad","a5","af","ae","a2",
"e2","ae","e0","2e","29","2e","0a","09","09","09","09","09","09","73","77","70",
"6f","72","20","3d","20","33","3b","0a","09","09","09","09","09","09","62","72",
"65","61","6b","3b","0a","09","09","09","09","09","09","7d","0a","09","09","09",
"09","09","7d","0a","09","09","09","09","7d","0a","0a","09","09","09","73","77",
"69","74","63","68","20","28","73","77","70","6f","72","29","0a","09","09","09",
"09","7b","0a","09","09","09","09","63","61","73","65","20","31","3a","0a","0a",
"09","09","09","09","2f","2f","20","87","a0","af","a8","e1","eb","a2","a0","a5",
"ac","20","a8","ad","e4","ae","e0","ac","a0","e6","a8","ae","ad","ad","eb","a9",
"20","a1","a0","a9","e2","2e","0a","09","09","09","09","2f","2f","20","37","2d",
"a9","20","a1","a8","e2","20","e3","a6","a5","20","a2","20","30","21","0a","09",
"09","09","09","61","72","72","61","79","63","6f","64","69","6e","67","38","5b",
"61","64","64","72","63","6f","64","69","6e","67","2b","2b","5d","20","3d","20",
"74","70","6f","72","32","3b","0a","0a","09","09","09","09","2f","2f","20","92",
"ae","ab","ec","aa","ae","20","e7","a0","e1","e2","ec","20","af","ae","e0","e6",
"a8","a8","2e","0a","09","09","09","09","66","6f","72","20","28","7a","32","20",
"3d","20","30","3b","20","7a","32","20","3c","20","74","70","6f","72","32","3b",
"29","0a","09","09","09","09","09","7b","0a","09","09","09","09","09","2f","2f",
"20","8f","a5","e0","a5","af","a8","e1","eb","a2","a0","a5","ac","20","ad","a5",
"af","ae","a2","e2","ae","e0","2e","20","a1","a0","a9","e2","eb","2e","0a","09",
"09","09","09","09","61","72","72","61","79","63","6f","64","69","6e","67","38",
"5b","61","64","64","72","63","6f","64","69","6e","67","2b","2b","5d","20","3d",
"20","61","72","72","61","79","31","5b","7a","33","2b","2b","5d","3b","0a","09",
"09","09","09","09","7a","32","2b","2b","3b","0a","09","09","09","09","09","7d",
"0a","0a","09","09","09","09","62","72","65","61","6b","3b","0a","0a","09","09",
"09","09","63","61","73","65","20","32","3a","0a","0a","09","09","09","09","2f",
"2f","20","92","ae","ab","ec","aa","ae","20","af","ae","ab","ad","a0","ef","20",
"af","ae","e0","e6","a8","ef","20","28","e2","ae","ab","ec","aa","ae","20","af",
"ae","ab","ad","eb","a5","20","af","ae","e0","e6","a8","a8","29","2e","0a","09",
"09","09","09","66","6f","72","20","28","7a","34","20","3d","20","30","3b","20",
"7a","34","20","3c","20","74","32","3b","29","0a","09","09","09","09","09","7b",
"0a","09","09","09","09","09","2f","2f","20","87","a0","af","a8","e1","eb","a2",
"a0","a5","ac","20","a8","ad","e4","ae","e0","ac","a0","e6","a8","ae","ad","ad",
"eb","a9","20","a1","a0","a9","e2","2e","0a","09","09","09","09","09","2f","2f",
"20","8c","a0","aa","e1","a8","ac","a0","ab","ec","ad","eb","a9","20","e0","a0",
"a7","ac","a5","e0","20","af","ae","e0","e6","a8","a8","2c","20","af","ab","ee",
"e1","20","37","2d","a9","20","a1","a8","e2","20","a2","20","30","2e","0a","09",
"09","09","09","09","61","72","72","61","79","63","6f","64","69","6e","67","38",
"5b","61","64","64","72","63","6f","64","69","6e","67","2b","2b","5d","20","3d",
"20","31","32","37","3b","0a","0a","09","09","09","09","09","66","6f","72","20",
"28","7a","32","20","3d","20","30","3b","20","7a","32","20","3c","20","31","32",
"37","3b","29","0a","09","09","09","09","09","09","7b","0a","09","09","09","09",
"09","09","2f","2f","20","8f","a5","e0","a5","af","a8","e1","eb","a2","a0","a5",
"ac","20","ad","a5","af","ae","a2","e2","ae","e0","2e","20","a1","a0","a9","e2",
"eb","2e","0a","09","09","09","09","09","09","61","72","72","61","79","63","6f",
"64","69","6e","67","38","5b","61","64","64","72","63","6f","64","69","6e","67",
"2b","2b","5d","20","3d","20","61","72","72","61","79","31","5b","7a","33","2b",
"2b","5d","3b","0a","09","09","09","09","09","09","7a","32","2b","2b","3b","0a",
"09","09","09","09","09","09","7d","0a","09","09","09","09","09","7a","34","2b",
"2b","3b","0a","09","09","09","09","09","7d","0a","0a","09","09","09","09","62",
"72","65","61","6b","3b","0a","0a","09","09","09","09","63","61","73","65","20",
"33","3a","0a","0a","09","09","09","09","2f","2f","20","8f","ae","ab","ad","a0",
"ef","20","af","ae","e0","e6","a8","ef","20","28","af","ae","ab","ad","eb","a5",
"20","af","ae","e0","e6","a8","a8","29","2e","0a","09","09","09","09","66","6f",
"72","20","28","7a","34","20","3d","20","30","3b","20","7a","34","20","3c","20",
"74","32","3b","29","0a","09","09","09","09","09","7b","0a","09","09","09","09",
"09","2f","2f","20","87","a0","af","a8","e1","eb","a2","a0","a5","ac","20","a8",
"ad","e4","ae","e0","ac","a0","e6","a8","ae","ad","ad","eb","a9","20","a1","a0",
"a9","e2","2e","0a","09","09","09","09","09","2f","2f","20","8c","a0","aa","e1",
"a8","ac","a0","ab","ec","ad","eb","a9","20","e0","a0","a7","ac","a5","e0","20",
"af","ae","e0","e6","a8","a8","2c","20","af","ab","ee","e1","20","37","2d","a9",
"20","a1","a8","e2","20","a2","20","30","2e","0a","09","09","09","09","09","61",
"72","72","61","79","63","6f","64","69","6e","67","38","5b","61","64","64","72",
"63","6f","64","69","6e","67","2b","2b","5d","20","3d","20","31","32","37","3b",
"0a","0a","09","09","09","09","09","66","6f","72","20","28","7a","32","20","3d",
"20","30","3b","20","7a","32","20","3c","20","31","32","37","3b","29","0a","09",
"09","09","09","09","09","7b","0a","09","09","09","09","09","09","2f","2f","20",
"8f","a5","e0","a5","af","a8","e1","eb","a2","a0","a5","ac","20","ad","a5","af",
"ae","a2","e2","ae","e0","2e","20","a1","a0","a9","e2","eb","2e","0a","09","09",
"09","09","09","09","61","72","72","61","79","63","6f","64","69","6e","67","38",
"5b","61","64","64","72","63","6f","64","69","6e","67","2b","2b","5d","20","3d",
"20","61","72","72","61","79","31","5b","7a","33","2b","2b","5d","3b","0a","09",
"09","09","09","09","09","7a","32","2b","2b","3b","0a","09","09","09","09","09",
"09","7d","0a","09","09","09","09","09","7a","34","2b","2b","3b","0a","09","09",
"09","09","09","7d","0a","0a","09","09","09","09","2f","2f","20","97","a0","e1",
"e2","ec","20","af","ae","e0","e6","a8","a8","20","28","ae","e1","e2","a0","e2",
"ae","aa","29","2e","0a","0a","09","09","09","09","2f","2f","20","87","a0","af",
"a8","e1","eb","a2","a0","a5","ac","20","a8","ad","e4","ae","e0","ac","a0","e6",
"a8","ae","ad","ad","eb","a9","20","a1","a0","a9","e2","2e","0a","09","09","09",
"09","2f","2f","20","37","2d","a9","20","a1","a8","e2","20","e3","a6","a5","20",
"a2","20","30","21","0a","09","09","09","09","61","72","72","61","79","63","6f",
"64","69","6e","67","38","5b","61","64","64","72","63","6f","64","69","6e","67",
"2b","2b","5d","20","3d","20","74","70","6f","72","32","3b","0a","0a","09","09",
"09","09","66","6f","72","20","28","7a","32","20","3d","20","30","3b","20","7a",
"32","20","3c","20","74","70","6f","72","32","3b","29","0a","09","09","09","09",
"09","7b","0a","09","09","09","09","09","2f","2f","20","8f","a5","e0","a5","af",
"a8","e1","eb","a2","a0","a5","ac","20","ad","a5","af","ae","a2","e2","ae","e0",
"2e","20","a1","a0","a9","e2","eb","2e","0a","09","09","09","09","09","61","72",
"72","61","79","63","6f","64","69","6e","67","38","5b","61","64","64","72","63",
"6f","64","69","6e","67","2b","2b","5d","20","3d","20","61","72","72","61","79",
"31","5b","7a","33","2b","2b","5d","3b","0a","09","09","09","09","09","7a","32",
"2b","2b","3b","0a","09","09","09","09","09","7d","0a","0a","09","09","09","09",
"62","72","65","61","6b","3b","0a","09","09","09","09","7d","0a","0a","09","09",
"09","2f","2f","20","8f","e0","a5","e0","a2","a0","e2","ec","20","73","77","69",
"74","63","68","2e","0a","09","09","09","62","72","65","61","6b","3b","0a","09",
"09","09","7d","0a","09","09","61","64","64","72","32","20","3d","20","61","64",
"64","72","32","20","2b","20","34","3b","0a","09","09","7d","0a","0a","09","2f",
"2f","20","82","a5","e0","ad","e3","e2","ec","20","a7","a0","aa","ae","a4","a8",
"e0","ae","a2","a0","ad","ad","eb","a9","20","ac","a0","e1","e1","a8","a2","2e",
"0a","09","72","65","74","75","72","6e","20","61","72","72","61","79","63","6f",
"64","69","6e","67","38","3b","0a","7d"

];

	var temp;

	temp = PrgJS(ArrayPRG1, "640px", "UTF8");

	// вставить в страницу функцию 1, функция написана на JavaScript.
	document.getElementById('id_vrle8js2').innerHTML = temp;

	temp = PrgJS(ArrayPRG2, "640px", "UTF8");

	// вставить в страницу функцию 2, функция написана на JavaScript.
	document.getElementById('id_vrle8js3').innerHTML = temp;

	temp = PrgJS(ArrayPRG3, "640px", "CP866");

	// вставить в страницу функцию 2, функция написана на JavaScript, исправленный вариант.
	document.getElementById('id_vrle8js4').innerHTML = temp;
}

//
// Функция подсчитывает сколько повтор. и неповтор в закодированном массиве.
// Функция не где не используется, так на всякий случай.
//
function qw(array)
{
	var bits, addr, t1, t2, tt;

	t1 = 0;
	t2 = 0;

	for (addr = 0; addr < array.length;)
		{
		bits = 128 & array[addr]; // 80H и array[addr].

		if (bits == 0)
			{
			// Неповтор.
			// ---

			tt = array[addr];
			t2 = t2 + tt;
			addr = addr + tt + 1;
			}
			else
			{
			// Повтор.
			// ---

			// Установить старший бит в ноль.
			tt = 127 & array[addr];
			t1 = t1 + tt;
			addr = addr + 2;

			}
		}

	alert("Повтор: " + t1 + "   " + "Неповтор: " + t2 + "   " + (t1 + t2));
}
