//
// Ukraine. (C) Демидов С.В.
//
// ---
// | Находим ближайшее стандартное сопротивление.
// | E24.
// ---
function SearchE24(R1)
{
	// Таблица резисторов Е24 (в Омах). Всего 216.
	// +- 5%.
	var ArrayE24 = [
			0.1, 0.11, 0.12, 0.13, 0.15, 0.16, 0.18, 0.2,
			0.22, 0.24, 0.27, 0.3, 0.33, 0.36, 0.39, 0.43,
			0.47, 0.51, 0.56, 0.62, 0.68, 0.75, 0.82, 0.91,
			1, 1.1, 1.2, 1.3, 1.5, 1.6, 1.8, 2,
			2.2, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.3,
			4.7, 5.1, 5.6, 6.2, 6.8, 7.5, 8.2, 9.1, 10, 11,
			12, 13, 15, 16, 18, 20, 22, 24,
			27, 30, 33, 36, 39, 43, 47, 51,
			56, 62, 68, 75, 82, 91, 100, 110,
			120, 130, 150, 160, 180, 200, 220, 240,
			270, 300, 330, 360, 390, 430, 470, 510,
			560, 620, 680, 750, 820, 910, 1000, 1100, 1200,
			1300, 1500, 1600, 1800, 2000, 2200, 2400, 2700,
			3000, 3300, 3600, 3900, 4300, 4700, 5100, 5600,
			6200, 6800, 7500, 8200, 9100, 10000, 11000, 12000,
			13000, 15000, 16000, 18000, 20000, 22000, 24000, 27000,
			30000, 33000, 36000, 39000, 43000, 47000, 51000, 56000,
			62000, 68000, 75000, 82000, 91000, 100000, 110000, 120000,
			130000, 150000, 160000, 180000, 200000, 220000, 240000, 270000,
			300000, 330000, 360000, 390000, 430000, 470000, 510000, 560000,
			620000, 680000, 750000, 820000, 910000, 1000000, 1100000, 1200000,
			1300000, 1500000, 1600000, 1800000, 2000000, 2200000, 2400000, 2700000,
			3000000, 3300000, 3600000, 3900000, 4300000, 4700000, 5100000, 5600000,
			6200000, 6800000, 7500000, 8200000, 9100000, 10000000, 11000000, 12000000,
			13000000, 15000000, 16000000, 18000000, 20000000, 22000000, 24000000, 27000000,
			30000000, 33000000, 36000000, 39000000, 43000000, 47000000, 51000000, 56000000,
			62000000, 68000000, 75000000, 82000000, 91000000
		];

	var z, E24, E24l, E24r;

	E24 = 0; E24l = 0; E24r = 0;

	// [ Шаг 1 ]
	// Ищем ближайшее стандартное.
	// Самое первое сопротивление!
	if (R1 < ArrayE24[0])
		{
		E24l = ArrayE24[0];
		}
		else
		{
		// [ Шаг 2 ]
		// Ищем ближайшее стандартное.
		// Самое последнее сопротивление!
		if (R1 > ArrayE24[215])
			{
			E24r = ArrayE24[215];
			}
			else
			{
			// [ Шаг 3 ]
			// Ищем ближайшее стандартное.
			// Проверим, может такое сопротивление есть в массиве!
			for(z = 0; z < ArrayE24.length; z++)
				{
				if (R1 == ArrayE24[z])
					{
					E24 = R1;
					break;
					}
				}

			if (E24 == 0)
				{
				// [ Шаг 4 ]
				// Ищем ближайшее стандартное.
				// Получаем значение слева и справа!
				for(z = 1; z < ArrayE24.length; z++)
					{
					if (ArrayE24[z] > R1)
						{
						// Слева.
						E24l = ArrayE24[z - 1];
						// Справа.
						E24r = ArrayE24[z];
						break;
						}
					}
				}
			}
		}

	// Самое первое сопротивление!
	// E24 = 0, E24l = Значение, E24r = 0.

	// Самое последнее сопротивление!
	// E24 = 0, E24l = 0, E24r = Значение.

	// Сопротивление есть в массиве!
	// E24 = Значение, E24l = 0, E24r = 0.

	// Ближайшее значение слева и справа!
	// E24 = 0, E24l = Значение слева, E24r = Значение справа.

	// Возвращаем массив!
	return [E24, E24l, E24r];
}